swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
/**************************************************************************//**
 * @file     startup.c
 * @brief    The System startup and HAL initialization for rtl8735b.
 * @version  V1.00
 * @date     2021-08-04
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2016 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b_ramstart.h"
#include "rtl8735b_symbns4s.h"
#include "stdio_port.h"
#include <arm_cmse.h>
#include "otp_boot_cfg.h"
#include "memory.h"
#include "fw_img.h"
#include "fw_img_tlv.h"
#include "fw_uart_boot.h"
#include "fw_snand_boot.h"
#include "shell.h"

#define SECTION_SYSSTART_TEXT                 SECTION(".sysstart.text")
#define SECTION_SYSSTART_BSS                  SECTION(".sysstart.bss")

#if IS_CUT_TEST(CONFIG_CHIP_VER)    // Test-chip
#define PG_TRAP_PIN                            (PIN_E8)
#define CPFT_TRAP_PIN                          (PIN_E7)
#else   // After A-cut
#define PG_TRAP_PIN                            (PIN_E5)
#define CPFT_TRAP_PIN                          (PIN_E6)
#endif
#define TST_GPIO_PIN_NUM                       (4)
#define NORMAL_MODE_PG_PTN                     (0x35)

#define RAM_FUN_TABLE_VALID_ITCM_START_ADDR    (0x00010000)
#define RAM_FUN_TABLE_VALID_ITCM_END_ADDR      (0x00030000)
#define RAM_FUN_TABLE_VALID_START_ADDR         (0x20100000)
#define RAM_FUN_TABLE_VALID_END_ADDR           (0x20180000)


enum sic_pins_e {
	PIN_SIC_SCL   = PIN_A2,
	PIN_SIC_SDA   = PIN_A3
};

enum {
	TEST_MODE_MISC_OPT0  = 0x00,
	TEST_MODE_MISC_OPT1  = 0x01,
	TEST_MODE_MISC_OPT2  = 0x02,
	TEST_MODE_MISC_OPT3  = 0x03,
	TEST_MODE_MISC_OPT4  = 0x04,
	TEST_MODE_MISC_OPT5  = 0x05,
	TEST_MODE_MISC_OPT6  = 0x06,
	TEST_MODE_MISC_OPT7  = 0x07,
	TEST_MODE_MISC_OPT8  = 0x08,
	TEST_MODE_MISC_OPT9  = 0x09,
	TEST_MODE_MISC_OPT10 = 0x0A,
	TEST_MODE_MISC_OPT11 = 0x0B,
	TEST_MODE_MISC_OPT12 = 0x0C,
	TEST_MODE_MISC_OPT13 = 0x0D,
	TEST_MODE_MISC_OPT14 = 0x0E,
	TEST_MODE_MISC_OPT15 = 0x0F
};

enum {
	BOOT_MOD_OTP_W = 0x0,
	BOOT_MOD_OTP_R = 0x1
};

typedef void __attribute__((cmse_nonsecure_call)) nsfunc(void);

extern uint32_t ConfigDebugErr;
extern uint32_t ConfigDebugWarn;
extern uint32_t ConfigDebugInfo;

extern uint32_t __Vectors;      // ROM Vector table
extern int_vector_t ram_vector_table[];
extern hal_spic_adaptor_t _hal_spic_adaptor;
extern hal_snafc_adaptor_t _hal_snafc_adaptor;
extern uboot_xm_frame_handler_t uboot_frame_handle;
extern hal_gpio_func_stubs_t hal_gpio_stubs;

#if   defined ( __CC_ARM )                                            /* ARM Compiler 4/5 */
extern uint32_t Image$$_STACK$$ZI$$Limit;
#define __StackTop Image$$_STACK$$ZI$$Limit
extern uint8_t Image$$_RAM_FUNC_TBL$$Base[];
#define __ram_start_table_start__ Image$$_RAM_FUNC_TBL$$Base
extern uint8_t Image$$_ROM_BSS$$Base[];
#define __rom_bss_start__ Image$$_ROM_BSS$$Base
extern uint8_t Image$$_ROM_BSS$$ZI$$Limit[];
#define __rom_bss_end__ Image$$_ROM_BSS$$ZI$$Limit
extern uint32_t Load$$_ROM_DATA$$Base;
#define __rom_etext Load$$_ROM_DATA$$Base
extern uint32_t Image$$_ROM_DATA$$Base;
#define __rom_data_start__ Image$$_ROM_DATA$$Base
extern uint32_t Image$$_ROM_DATA$$Limit;
#define __rom_data_end__ Image$$_ROM_DATA$$Limit
extern uint8_t Image$$_ROM_TEMP_BSS$$Base[];
#define __rom_temp_bss_start__ Image$$_ROM_TEMP_BSS$$Base
extern uint8_t Image$$_ROM_TEMP_BSS$$ZI$$Limit[];
#define __rom_temp_bss_end__ Image$$_ROM_TEMP_BSS$$ZI$$Limit
extern uint8_t Image$$_RAM_IMG_SIGN$$Base[];
#define __ram_img_signature__ Image$$_RAM_IMG_SIGN$$Base
#elif defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)       /* ARM Compiler 6 */
extern uint32_t Image$$_STACK$$ZI$$Limit;
#define __StackTop Image$$_STACK$$ZI$$Limit
extern uint8_t Image$$_RAM_FUNC_TBL$$Base[];
#define __ram_start_table_start__ Image$$_RAM_FUNC_TBL$$Base
extern uint8_t Image$$_ROM_BSS$$ZI$$Base[];
#define __rom_bss_start__ Image$$_ROM_BSS$$ZI$$Base
extern uint8_t Image$$_ROM_BSS$$ZI$$Limit[];
#define __rom_bss_end__ Image$$_ROM_BSS$$ZI$$Limit
extern uint32_t Load$$_ROM_DATA$$Base;
#define __rom_etext Load$$_ROM_DATA$$Base
extern uint32_t Image$$_ROM_DATA$$Base;
#define __rom_data_start__ Image$$_ROM_DATA$$Base
extern uint32_t Image$$_ROM_DATA$$Limit;
#define __rom_data_end__ Image$$_ROM_DATA$$Limit
extern uint8_t Image$$_ROM_TEMP_BSS$$Base[];
#define __rom_temp_bss_start__ Image$$_ROM_TEMP_BSS$$Base
extern uint8_t Image$$_ROM_TEMP_BSS$$ZI$$Limit[];
#define __rom_temp_bss_end__ Image$$_ROM_TEMP_BSS$$ZI$$Limit
extern uint8_t Image$$_RAM_IMG_SIGN$$Base[];
#define __ram_img_signature__ Image$$_RAM_IMG_SIGN$$Base
extern uint8_t Image$$_ROM_SBOOT_BSS$$Base[];
#define __rom_sboot_bss_start__ Image$$_ROM_SBOOT_BSS$$Base
extern uint8_t Image$$_ROM_SBOOT_BSS$$ZI$$Limit[];
#define __rom_sboot_bss_end__ Image$$_ROM_SBOOT_BSS$$ZI$$Limit
#elif defined ( __GNUC__ )
extern uint32_t __StackTop;
extern uint8_t __ram_start_table_start__[];
extern uint8_t __rom_bss_start__[];
extern uint8_t __rom_bss_end__[];
extern uint32_t __rom_etext;
extern uint32_t __rom_data_start__;
extern uint32_t __rom_data_end__;
extern uint8_t __rom_temp_bss_start__[];
extern uint8_t __rom_temp_bss_end__[];
extern uint8_t __ram_img_signature__[];
extern uint8_t __rom_sboot_bss_start__[];
extern uint8_t __rom_sboot_bss_end__[];
extern uint8_t __rom_boot_loader_tmp_buf_start__[];
extern uint8_t __rom_boot_loader_tmp_buf_end__[];
#endif

