swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
SECTION_SYSSTART_BSS uint8_t fast_boot;
SECTION_SYSSTART_BSS PRAM_FUNCTION_START_TABLE pRamStartFun;
SECTION_SYSSTART_BSS PRAM_FUNCTION_START_TABLE pFastBootStartFun;

#if !CONFIG_BOOT_TRAP_CTRL
SECTION_SYSSTART_BSS uint32_t test_mode;
SECTION_SYSSTART_BSS uint8_t test_pg_trap_gpio;
SECTION_SYSSTART_BSS uint8_t test_gpio_port;
SECTION_SYSSTART_BSS uint32_t boot_mode;
#endif

SECTION_SYSSTART_BSS uint8_t fast_reboot_rdy;

#if CONFIG_FPGA // FPGA TEST ONLY
#if CONFIG_BOOT_SETMOD_EN
SECTION_SYSSTART_BSS uint8_t exit_set_mode;
SECTION_SYSSTART_BSS shell_command_entry_t cmd_info[5];
#endif
#endif // FPGA TEST ONLY

extern int32_t otu_fw_download_cmd(int argc, char **argv);
extern int32_t test_mode_flash_chip_erase_cmd(int argc, char **argv);
extern int32_t test_mode_flash_sector_erase_cmd(int argc, char **argv);
extern int32_t otu_fw_download(uint32_t uart_sel, uint32_t baud_rate, uint32_t flash_sel, uint32_t flash_offset);
int32_t otp_operate_cmd(int argc, char **argv);
#if CONFIG_FPGA  // FPGA
int32_t otp_dump_all_cmd(int argc, char **argv);
#endif
extern hal_status_t fw_spic_init(phal_spic_adaptor_t phal_spic_adaptor, u8 spic_bit_mode, u8 io_pin_sel);
extern int32_t flash_boot(PRAM_FUNCTION_START_TABLE *pram_start_func);
extern int32_t uart_boot(PRAM_FUNCTION_START_TABLE *pram_start_func);
extern void shell_cmd_task_init(void);
extern void rom_cmd_shell_set_prompt(void);
extern void shell_cmd_task(void);
extern _LONG_CALL_ void test_mode_img_download(void);
extern void _LONG_CALL_ *_memset(void *dst0, int Val, SIZE_T length);
extern void clear_export_partition_tbl(void);
extern void erase_loaded_image(void);
extern int32_t is_key_valid(uint8_t *pkey);

_LONG_CALL_ extern int rtl_cryptoEngine_init_s(void *pIE1);
_LONG_CALL_ extern int rtl_cryptoEngine_deinit_s(void *pIE1);
_LONG_CALL_ extern int rtl_crypto_aes_cbc_init_s(IN const u8 *key, IN const u32 keylen);
_LONG_CALL_ extern int rtl_crypto_aes_cbc_decrypt_s(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 ivlen,
	OUT u8 *pResult);
_LONG_CALL_ extern int rtl_crypto_aes_cbc_encrypt_s(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 ivlen,
	OUT u8 *pResult);
_LONG_CALL_ extern int rtl_crypto_hmac_sha2_256_init_s(IN const u8 *key, IN const u32 keylen);
_LONG_CALL_ extern int rtl_crypto_hmac_sha2_256_update_s(IN const u8 *message, IN const u32 msglen);
_LONG_CALL_ extern int rtl_crypto_hmac_sha2_256_final_s(OUT u8 *pDigest);
_LONG_CALL_ u32 _strtoul(const char *nptr, char **endptr, int base);
#if 1
extern void ram_start(void) __attribute__((noreturn));
extern uint8_t uart_tr_pin[];
extern shell_command_t shell_cmd_hdl_rom;

extern hal_crypto_adapter_t _crypto_engine;
extern uint8_t export_hash_priv_key[];
extern uint8_t ss_priv_key[PRIV_KEY_SIZE];
extern uint8_t aes_iv[];
extern uint8_t aes_key[AES_KEY_SIZE];
extern const uint8_t aes_init_iv[];
extern uint8_t hash_priv_key_enced[PRIV_KEY_SIZE];
extern uint8_t hash_priv_key[PRIV_KEY_SIZE];
extern uint8_t hash_key[HASH_KEY_SIZE];
extern uint8_t temp_dec_buf[];
#endif
extern shell_command_t shell_cmd_hdl_rom;

//typedef void __attribute__((cmse_nonsecure_call)) (hal_uart_adapter_init) (phal_uart_adapter_t puart_adapter, u8 uart_idx, phal_uart_defconfig_t pconfig);

// fp can point to a secure function or a non-secure function
//nsfunc *fp_hal_uart_adapter_init = cmse_nsfptr_create ((nsfunc *) hal_uart_adapter_init_rtl8195bhp));

void rom_bss_data_init(void);

const char RamImgValidatePat[] = {
	'A', 'm', 'e', 'b', 'a', 'P', 'r', 'o', '2', 0xFF
};

const u8 cmd_shell_pwd[] = {
	'R', 'T', 'K', '8', '7', '3', '5', 'B'
};

const uint32_t rom_log_uart_rx_pins[2][4] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)    // Test-chip    
	/*           UART1,    UART2,  UART3    UART1    */
	/* S0 */    {PIN_F4,  PIN_D16, PIN_E6, PIN_F4},
	/* S1 */    {PIN_F12,  PIN_E2, PIN_E6, PIN_F12}
#else   // After A-cut
	/*           UART1,    UART2,  UART3    UART1    */
	/* S0 */    {PIN_F3,  PIN_D16, PIN_E2, PIN_F3},
	/* S1 */    {PIN_F12,  PIN_D20, PIN_E2, PIN_F12}
#endif
};

const uint32_t rom_log_uart_tx_pins[2][4] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)    // Test-chip       
	/*           UART1,    UART2,  UART3    UART1    */
	/* S0 */    {PIN_F5,  PIN_D15, PIN_E5, PIN_F5},
	/* S1 */    {PIN_F13,  PIN_E1, PIN_E5, PIN_F13}
#else   // After A-cut
	/*           UART1,    UART2,  UART3    UART1    */
	/* S0 */    {PIN_F4,  PIN_D15, PIN_E1, PIN_F4},
	/* S1 */    {PIN_F13,  PIN_E0, PIN_E1, PIN_F13}
#endif
};

const uint32_t boot_uart_baud_sel_map[8] = {
	115200,  230400,  460800,  1000000,
	2000000, 3000000, 4000000, 6000000
};

const uint32_t _dbg_port_tms_io_pin_sel[2] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)    // Test-chip      
	/* S0 */    PIN_A0,
	/* S1 */    PIN_F11
#else   // After A-cut
	/* S0 */    PIN_A0,
	/* S1 */    PIN_F10
#endif
};

const uint32_t _dbg_port_clk_pin_sel[2] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)    // Test-chip      
	/* S0 */    PIN_A1,
	/* S1 */    PIN_F10
#else   // After A-cut
	/* S0 */    PIN_A1,
	/* S1 */    PIN_F9
#endif
};

const uint32_t _dbg_port_jtag_fixed_pins[3] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)    // Test-chip       
	/* pin_tdo, pin_tdi, pin_trst */
	PIN_F6, PIN_F7, PIN_F12
#else   // After A-cut
	/* pin_tdo, pin_tdi, pin_trst */
	PIN_F6, PIN_F7, PIN_F11
#endif
};

const char sce_cfg_sign[] = "8735bsce";

const shell_command_entry_t boot_cmd_tbl[SHELL_BOOT_ROM_CMD_LIST_SIZE] = {
	{
		"BOOT_ROM", (const char *)"fwd", (shell_program_t)otu_fw_download_cmd,
		(const char *)" fwd <uart_pin_tx, Dec> <uart_pin_rx, Dec> <baud_rate, Dec> <parity> <flow ctrl> \r\n"
		"\t\t\t\t    <flash_io> <flash_pin> <flash_offset_4K_aligned>:\r\n"
		"\t\t\t\tTo download Flash image over UART\r\n"
	},
	{
		"BOOT_ROM", (const char *)"ceras", (shell_program_t)test_mode_flash_chip_erase_cmd,
		(const char *)" ceras <io_mode> <pin_sel> \r\n"
		"\t\t\t\tFlash chip erase\r\n"
	},
	{
		"BOOT_ROM", (const char *)"seras", (shell_program_t)test_mode_flash_sector_erase_cmd,
		(const char *)" seras <offset> <len> <io_mode> <pin_sel> \r\n"\
		"\t\t\t\tFlash sector erase\r\n"
	},
	{
		"BOOT_ROM", (const char *)"otp_op", (shell_program_t)otp_operate_cmd,
		(const char *)" otp_op <write(0x0)/read(0x1)> <otp_mem_address, Hex> <w_Value, Hex> \r\n"
		"\t\t\t\tOTP Read/Write one byte operate\r\n"
	},

#if CONFIG_FPGA  // FPGA
	{
		"BOOT_ROM", (const char *)"otp_dp_all", (shell_program_t)otp_dump_all_cmd,
		(const char *)" otp_dp_all \r\n"
		"\t\t\t\tOTP Dump all bytes for rom simu\r\n"
	},
#else   // PXP & ASIC
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
#endif
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL},
	{"BOOT_ROM", (const char *)NULL, (shell_program_t)NULL, (const char *)NULL}   // end of table
};

const uint8_t otp_rma1_mgn[RMA1_MGN_PTN_SIZE] = {
	0x38, 0x37, 0x33, 0x35, 0x42, 0x72, 0x6D, 0x61
};

SECTION_ROM_TEMP_BSS hal_uart_adapter_t stdio_uart;
SECTION_ROM_TEMP_BSS shell_command_entry_t shell_rom_cmd_list[SHELL_ROM_CMD_LIST_SIZE];
SECTION_ROM_TEMP_BSS hal_timer_group_adapter_t _timer_group1;
SECTION_ROM_TEMP_BSS hal_timer_adapter_t _system_timer;
SECTION_ROM_TEMP_BSS hal_timer_group_adapter_t _timer_group3;
SECTION_ROM_TEMP_BSS hal_timer_adapter_t _fcs_system_timer;
SECTION_ROM_TEMP_BSS hal_pin_mux_mang_t _pinmux_manager;
SECTION_ROM_TEMP_BSS hal_gpio_comm_adapter_t gpio_comm;
SECTION_ROM_TEMP_BSS hal_gpio_adapter_t test_mode_trap_gpio;
SECTION_ROM_TEMP_BSS uint32_t dbg_uart_rx_pin;

SECTION_SYSSTART_TEXT
BOOLEAN ram_start_addr_valid(uint32_t addr)
{

	if (((addr >= RAM_FUN_TABLE_VALID_ITCM_START_ADDR) && (addr < RAM_FUN_TABLE_VALID_ITCM_END_ADDR)) ||
		((addr >= RAM_FUN_TABLE_VALID_START_ADDR) && (addr < RAM_FUN_TABLE_VALID_END_ADDR))) {
		return 1;
	} else {
		return 0;
	}
}

SECTION_SYSSTART_TEXT
void stdio_uart_port_init(void)
{
	uint32_t tx_pin;
	uint32_t rx_pin;
	uint8_t uart_idx;
	uint32_t i;

