swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
#if defined(CONFIG_BUILD_SECURE)
	symb_ns4s_t *symb_ns4s_stubs = (symb_ns4s_t *)(NS_SYMBOL_STUBS_ADDR);
#endif
	otp_boot_cfg_t *potp_boot_cfg = otpBootCfg;
	otp_boot_cfg2_t dbg_cfg;
	/*
	 *   Normal path:
	 * - directly using UART1 as log UART
	 *
	 */
#if CONFIG_PXP  // PXP
	rx_pin = STDIO_UART_RX_PIN;
	tx_pin = STDIO_UART_TX_PIN;
#else   // FPGA/ ASIC
	dbg_cfg.byte = potp_boot_cfg->byte.cfg2.byte;
	rx_pin = rom_log_uart_rx_pins[dbg_cfg.bit.rom_log_rx_pin_sel][dbg_cfg.bit.rom_log_port_sel];
	tx_pin = rom_log_uart_tx_pins[dbg_cfg.bit.rom_log_tx_pin_sel][dbg_cfg.bit.rom_log_port_sel];
#endif
	uart_idx = hal_rtl_uart_rx_pin_to_idx(rx_pin);
	hal_rtl_pinmux_register(rx_pin, (PID_UART0 + uart_idx));
	hal_rtl_pinmux_register(tx_pin, (PID_UART0 + uart_idx));

	// RX Pin pull-high to prevent this folating on this pin
	dbg_uart_rx_pin = rx_pin;
	hal_rtl_gpio_pull_ctrl(dbg_uart_rx_pin, Pin_PullUp);
	// wait ready, delay ~4us
	for (i = 0; i < 45; i++) {
		__NOP();
		__NOP();
		__NOP();
		__NOP();
		__NOP();
	}
	hal_rtl_uart_init(&stdio_uart, tx_pin, rx_pin, NULL);
	hal_rtl_uart_set_baudrate(&stdio_uart, 115200);
	hal_rtl_uart_set_format(&stdio_uart, 8, UartParityNone, 1);

	// hook the putc function to stdio
	_stdio_port_init((void *)&stdio_uart, (stdio_putc_t)&hal_rtl_uart_wputc,
					 (stdio_getc_t)&hal_rtl_uart_rgetc);
#if defined(CONFIG_BUILD_SECURE)
	// Initial NS region stdio port
	symb_ns4s_stubs->stdio_port_init_ns((void *)&stdio_uart, (stdio_putc_t)&hal_rtl_uart_wputc, \
										(stdio_getc_t)&hal_rtl_uart_rgetc);
#endif
	ConfigDebugErr = 0xFFFFFFFF;
}

SECTION_SYSSTART_TEXT
int32_t chk_ram_img_signature(char *sign)
{
	uint32_t i;
	int32_t ret = 0;

	for (i = 0; i < sizeof(RamImgValidatePat); i++) {
		if (RamImgValidatePat[i] == 0xFF) {
			break;
		}

		if (RamImgValidatePat[i] != sign[i]) {
//            dbg_printf ("Invalid RAM Image Signature!\r\n");
			ret = 1;
			break;
		}
	}

	return ret;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void get_chip_ver_info(uint8_t *vndr_id, uint8_t *chip_ver)
{

	/*
	  AON 0x4000_90C4[11:8] -> vendor id
	  AON 0x4000_90C4[7:4] -> chip version
	 */
	AON_TypeDef *aon = AON;
	volatile uint32_t reg_val;
	reg_val = aon->AON_REG_AON_SYS_INFO0;
	*vndr_id   = (reg_val & AON_MASK_VENDOR_ID);
	*chip_ver  = (reg_val & AON_MASK_CHIP_VER);
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void get_rom_ver_info(uint8_t *ver_main, uint8_t *ver_sub)
{
	/*
	  AON 0x4000_90C8[7:4] -> Main Number
	  AON 0x4000_90C8[3:0] -> Sub Number
	 */
	AON_TypeDef *aon = AON;
	volatile uint32_t reg_val;
	reg_val = aon->AON_REG_AON_SYS_INFO1;
	*ver_main = ((reg_val & AON_MASK_SYSCFG_ROM_INFO) & 0xF0) >> 4;
	*ver_sub  = ((reg_val & AON_MASK_SYSCFG_ROM_INFO) & 0xF);
}

SECTION_SYSSTART_TEXT
void show_welcome_message(void)
{

	uint8_t vndor_id, chip_ver, rom_ver_main, rom_ver_sub;
	dbg_printf("\r\n== Rtl8735b IoT Platform ==\r\n");
	get_chip_ver_info(&vndor_id, &chip_ver);
	get_rom_ver_info(&rom_ver_main, &rom_ver_sub);
	dbg_printf("Chip VID: %u, Ver: %u\r\n", vndor_id, chip_ver);
	dbg_printf("ROM Version: v%d.%d\r\n", rom_ver_main, rom_ver_sub);
#if CONFIG_FPGA || CONFIG_PXP
	dbg_printf("ROM Build @ %s, %s\r\n", __TIME__, __DATE__);
#endif
}

SECTION_SYSSTART_TEXT
void rom_temp_bss_clean_up(void)
{
	u32 bss_len;

	bss_len = (__rom_temp_bss_end__ - __rom_temp_bss_start__);
	_memset((void *)__rom_temp_bss_start__, 0, bss_len);
}

#if defined(CONFIG_BUILD_SECURE) && (LOAD_FLAH_IMG_EN)
#define IMG2_START_ADDR_REG                 (0x50000828)  // in S region

SECTION_SYSSTART_TEXT
void erase_boot_loader(uint32_t code_start, uint32_t code_size, uint32_t img2_entry)
{
	PRAM_FUNCTION_START_TABLE pRamStartFun = (PRAM_FUNCTION_START_TABLE)0;
	if (code_size > 0) {
		_memset((void *)code_start, 0, code_size);
		rtl_dcache_clean_by_addr((uint32_t *)code_start, code_size);
	}
	pRamStartFun = (PRAM_FUNCTION_START_TABLE)img2_entry;
	ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 30);
	if (chk_ram_img_signature(pRamStartFun->Signature)) {
		dbg_printf("erase_boot_loader==> code_start=0x%x code_size=0x%x pRamStartFun=0x%x\r\n", \
				   code_start, code_size, img2_entry);
		dbg_printf("erase_boot_loader: Invalid Image2 Signature!\r\n");
		goto __erase_boot_loader_err;
	} else {
		// ram img simple signature check pass
		rtl_dcache_disable();
		pFastBootStartFun = (PRAM_FUNCTION_START_TABLE)img2_entry;
		ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 31);

		if ((pRamStartFun->msp_start != 0) && (pRamStartFun->msp_start > pRamStartFun->msp_limit)) {
			// switch the main stack memory as the application defined
			__disable_irq();
			__ISB();
			__set_MSP((uint32_t)pRamStartFun->msp_start);
			__set_MSPLIM((uint32_t)pRamStartFun->msp_limit);
			// !!! Don't access local variable after this line... !!!
			__enable_irq();
			__DSB();
			__ISB();
		}

		pRamStartFun->RamStartFun();
	}
__erase_boot_loader_err:
	//boot_fail_log_uart_resume();
	//boot_command_shell();
	return;
}


SECTION_SYSSTART_TEXT
void rom_sboot_bss_clean_up(void)
{
	u32 bss_len;

	// Clean secure boot memory to prevent securite leakedge
	bss_len = (__rom_sboot_bss_end__ - __rom_sboot_bss_start__);
	_memset((void *)__rom_sboot_bss_start__, 0, bss_len);
	rtl_dcache_clean_by_addr((void *)__rom_sboot_bss_start__, bss_len);
}

SECTION_SYSSTART_TEXT
void rom_sboot_export_bss_clean_up(void)
{
	u32 bss_len;

	// Clean secure boot memory to prevent securite leakedge
	bss_len = (__rom_boot_loader_tmp_buf_end__ - __rom_boot_loader_tmp_buf_start__);
	_memset((void *)__rom_boot_loader_tmp_buf_start__, 0, bss_len);
	rtl_dcache_clean_by_addr((void *)__rom_boot_loader_tmp_buf_start__, bss_len);


}

SECTION_SYSSTART_TEXT
void fast_boot_xip_sce_restore(hal_xip_sce_cfg_t *pxip_sce_cfg, uint32_t key_rdy)
{

}

SECTION_SYSSTART_TEXT
int32_t fast_boot_img2(PRAM_FUNCTION_START_TABLE *pram_start_func)
{
	int ret = 0;
	return ret;
}

#endif  // #if defined(CONFIG_BUILD_SECURE)

SECTION_SYSSTART_TEXT
void super_secure_otp_lock(void)
{

}

SECTION_SYSSTART_TEXT
int32_t otp_operate_cmd(int argc, char **argv)
{
	u8 read_data = 0xff;
	u8 argc_idx;
	u32 InPutData[5];

