swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
	if (argc > 5) {
		argc = 5;   // prevent stack corrupting
	}

	for (argc_idx = 0; argc_idx < argc; argc_idx++) {
		InPutData[argc_idx] = _strtoul((const char *)(argv[argc_idx]), (char **)NULL, 16);
	}
	hal_rtl_otp_init();
	switch (InPutData[0]) {
	case BOOT_MOD_OTP_W:
		// Write OTP one byte
		dbg_printf("\n ==== write OTP one byte ====\r\n");
		dbg_printf("write 0x%x = 0x%x\r\n", InPutData[1], InPutData[2]);
		//hal_rtl_otp_byte_wr_syss(InPutData[1], (uint8_t)InPutData[2]);
		hal_rtl_otp_byte_wr_marr_syss(InPutData[1], (uint8_t)InPutData[2], DISABLE);
		break;
	case BOOT_MOD_OTP_R:
		// Read OTP one byte
		dbg_printf("\n ==== read OTP one byte ====\r\n");
		read_data = hal_rtl_otp_byte_rd_syss(InPutData[1]);
		dbg_printf("read 0x%x = 0x%x\r\n", InPutData[1], read_data);
		break;
	default:
		break;
	}
	hal_rtl_otp_deinit();
	return 0;
}

#if CONFIG_FPGA  // FPGA
SECTION_SYSSTART_TEXT
int32_t otp_dump_all_cmd(int argc, char **argv)
{
	uint8_t argc_idx;
	uint32_t InPutData[5], j = 0x0;
	uint32_t otp_addr = 0x0;
	const uint32_t otp_mem_max_size = 2048;
	uint8_t mem_buf[2048];

	if (argc > 5) {
		argc = 5;   // prevent stack corrupting
	}

	for (argc_idx = 0; argc_idx < argc; argc_idx++) {
		InPutData[argc_idx] = _strtoul((const char *)(argv[argc_idx]), (char **)NULL, 16);
	}
	_memset(&mem_buf[0], 0xFF, otp_mem_max_size);
	hal_rtl_otp_init();
	for (j = 0; j < otp_mem_max_size; j++) {
		mem_buf[j] = hal_rtl_otp_byte_rd_syss((otp_addr + j));
	}
	hal_rtl_otp_deinit();
	dbg_printf("------------- Dump all OTP Mem -------------\r\n");
	for (j = 0; j < otp_mem_max_size; j = j + 16) {
		dbg_printf("[addr:0x%03x] %02x %02x %02x %02x %02x %02x %02x %02x  %02x %02x %02x %02x %02x %02x %02x %02x\r\n",
				   (otp_addr + j), mem_buf[0 + j], mem_buf[1 + j], mem_buf[2 + j], mem_buf[3 + j], mem_buf[4 + j], mem_buf[5 + j], mem_buf[6 + j], mem_buf[7 + j],
				   mem_buf[8 + j], mem_buf[9 + j], mem_buf[10 + j], mem_buf[11 + j], mem_buf[12 + j], mem_buf[13 + j],
				   mem_buf[14 + j], mem_buf[15 + j]);
	}
	dbg_printf("\r\n");
	return 0;
}
#endif

void boot_command_shell(void) __attribute__((noreturn));

SECTION_SYSSTART_TEXT
void boot_command_shell(void)
{
	uint32_t cmd_idx;
	otp_boot_cfg_t *potp_boot_cfg = otpBootCfg;

	// password confirm
	char pwd[9];

	// Inhibit Supre-Secure OTP access
	//super_secure_otp_lock();

	uint32_t i;

	if ((BootDbgMsgOff == (potp_boot_cfg->byte.cfg2.bit.boot_rom_dbg_msg_dis)) &&
		(DISABLE == stdio_uart.is_inited)) {
		stdio_uart_port_init();
		ConfigDebugErr = 0xFFFFFFFF;
	}

	for (i = 0; i < 8; i++) {
		while (!_stdio_port_getc(&pwd[i]));
	}
	if (_memcmp_s((void *)pwd, cmd_shell_pwd, 8)) {
		// Wrong pass word
		while (1);
	}

	// wdt(AON/VNDR) disable
	hal_rtl_wdt_ctrl_all_disable();

	dbg_printf("<Boot command shell on-going>\r\n");
#if defined(CONFIG_BUILD_SECURE)
	symb_ns4s_t *symb_ns4s_stubs = (symb_ns4s_t *)(NS_SYMBOL_STUBS_ADDR);
	const cmd_shell_func_stubs_t *pcmd_shell_stubs = symb_ns4s_stubs->pcmd_shell_stubs;
	// Initial NS region stdio port
	symb_ns4s_stubs->stdio_port_init_ns((void *)&stdio_uart, (stdio_putc_t)&hal_rtl_uart_wputc, \
										(stdio_getc_t)&hal_rtl_uart_rgetc);

	// Initial command shell
	pcmd_shell_stubs->shell_cmd_task_init();
	pcmd_shell_stubs->shell_rom_cmd_set_prompt();
	pcmd_shell_stubs->shell_set_cmd_list(pcmd_shell_stubs->shell_cmd_hdl, shell_rom_cmd_list, SHELL_ROM_CMD_LIST_SIZE);
	pcmd_shell_stubs->shell_unregister_all(pcmd_shell_stubs->shell_cmd_hdl);
	for (cmd_idx = 0; cmd_idx < SHELL_BOOT_ROM_CMD_LIST_SIZE; cmd_idx++) {
		pcmd_shell_stubs->shell_register(pcmd_shell_stubs->shell_cmd_hdl, (shell_command_entry_t *) &boot_cmd_tbl[cmd_idx]);
	}

	while (1) {
		pcmd_shell_stubs->shell_task(pcmd_shell_stubs->shell_cmd_hdl);
	}
#else
	// Initial command shell
	shell_cmd_task_init();
	rom_cmd_shell_set_prompt();
	_shell_set_cmd_list(&shell_cmd_hdl_rom, shell_rom_cmd_list, SHELL_ROM_CMD_LIST_SIZE);
	_shell_unregister_all(&shell_cmd_hdl_rom);
	for (cmd_idx = 0; cmd_idx < SHELL_BOOT_ROM_CMD_LIST_SIZE; cmd_idx++) {
		_shell_register(&shell_cmd_hdl_rom, &boot_cmd_tbl[cmd_idx]);
	}

	while (1) {
		shell_cmd_task();
	}
#endif
}

#if CONFIG_FPGA  // FPGA TEST ONLY

#if !CONFIG_BOOT_TRAP_CTRL
#if CONFIG_BOOT_SETMOD_EN
SECTION_SYSSTART_TEXT
int32_t set_test_mode_pg_cmd(int argc, char **argv)
{
	test_mode = 1;
	test_pg_trap_gpio = 1;
	exit_set_mode = 1;
	dbg_printf("<Set test mode PG>\r\n");
	return 0;
}

SECTION_SYSSTART_TEXT
int32_t set_flash_boot_cmd(int argc, char **argv)
{
	exit_set_mode = 1;
	boot_mode = BootFromNORFlash;
	dbg_printf("<Set BootFromNORFlash>\r\n");
	dbg_printf("<Leave Boot set mode shell>\r\n");
	test_mode = 1;
	test_pg_trap_gpio = 0;
	return 0;
}

SECTION_SYSSTART_TEXT
int32_t exit_setmode_cmd(int argc, char **argv)
{
	exit_set_mode = 1;
	boot_mode = BootFromJTAG_FPGALOAD;
	dbg_printf("<Set BootFromJTAG_FPGALOAD>\r\n");
	dbg_printf("<Leave Boot set mode shell>\r\n");
	return 0;
}

SECTION_SYSSTART_TEXT
void boot_setmode_shell(void)
{
	dbg_printf("<Boot set mode shell on-going>\r\n");

#if defined(CONFIG_BUILD_SECURE)
	symb_ns4s_t *symb_ns4s_stubs = (symb_ns4s_t *)(NS_SYMBOL_STUBS_ADDR);
	const cmd_shell_func_stubs_t *pcmd_shell_stubs = symb_ns4s_stubs->pcmd_shell_stubs;

	// Initial command shell
	pcmd_shell_stubs->shell_cmd_task_init();
	pcmd_shell_stubs->shell_rom_cmd_set_prompt();
	pcmd_shell_stubs->shell_set_cmd_list(pcmd_shell_stubs->shell_cmd_hdl, shell_rom_cmd_list, SHELL_ROM_CMD_LIST_SIZE);
	pcmd_shell_stubs->shell_unregister_all(pcmd_shell_stubs->shell_cmd_hdl);
	cmd_info[0].shell_program = &set_test_mode_pg_cmd;
	cmd_info[0].shell_command_string = "pg";
	cmd_info[0].shell_command_type = "BOOT";
	cmd_info[0].help_string = "\tenable test mode pg cmd.\r\n";
	pcmd_shell_stubs->shell_register(pcmd_shell_stubs->shell_cmd_hdl, &cmd_info[0]);
	cmd_info[1].shell_program = &exit_setmode_cmd;
	cmd_info[1].shell_command_string = "q";
	cmd_info[1].shell_command_type = "BOOT";
	cmd_info[1].help_string = "\texit.\r\n";
	pcmd_shell_stubs->shell_register(pcmd_shell_stubs->shell_cmd_hdl, &cmd_info[1]);
	cmd_info[2].shell_program = &set_flash_boot_cmd;
	cmd_info[2].shell_command_string = "bff";
	cmd_info[2].shell_command_type = "BOOT";
	cmd_info[2].help_string = "\tset boot from flash.\r\n";
	pcmd_shell_stubs->shell_register(pcmd_shell_stubs->shell_cmd_hdl, &cmd_info[2]);

	while (1) {
		if (1 == exit_set_mode) {
			break;
		}
		pcmd_shell_stubs->shell_task(pcmd_shell_stubs->shell_cmd_hdl);
	}
#else
	shell_cmd_task_init();
	rom_cmd_shell_set_prompt();
	_shell_set_cmd_list(&shell_cmd_hdl_rom, shell_rom_cmd_list, SHELL_ROM_CMD_LIST_SIZE);
	_shell_unregister_all(&shell_cmd_hdl_rom);
	cmd_info[0].shell_program = &set_test_mode_pg_cmd;
	cmd_info[0].shell_command_string = "pg";
	cmd_info[0].shell_command_type = "BOOT";
	cmd_info[0].help_string = "\tenable test mode pg cmd.\r\n";
	_shell_register(&shell_cmd_hdl_rom, &cmd_info[0]);
	cmd_info[1].shell_program = &exit_setmode_cmd;
	cmd_info[1].shell_command_string = "q";
	cmd_info[1].shell_command_type = "BOOT";
	cmd_info[1].help_string = "\texit.\r\n";
	_shell_register(&shell_cmd_hdl_rom, &cmd_info[1]);
	cmd_info[2].shell_program = &set_flash_boot_cmd;
	cmd_info[2].shell_command_string = "bff";
	cmd_info[2].shell_command_type = "BOOT";
	cmd_info[2].help_string = "\tset boot from flash.\r\n";
	_shell_register(&shell_cmd_hdl_rom, &cmd_info[2]);

	while (1) {
		if (1 == exit_set_mode) {
			break;
		}
		shell_cmd_task();
	}
#endif
}
#endif
#endif

#endif  // FPGA TEST ONLY

SECTION_SYSSTART_TEXT
void rom_bss_data_init(void)
{
	uint32_t bss_len;

	// Clear BSS for ROM code
	bss_len = (__rom_bss_end__ - __rom_bss_start__);
	_memset((void *)__rom_bss_start__, 0, bss_len);

	rom_temp_bss_clean_up();
#if !(CONFIG_FPGA && (defined ( __CC_ARM ) || (defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))))
	uint32_t *pSrc, *pDest;
	// For FPGA verification and load image from ELF, the ARMCC has no section for RW data initialization
	// initial ROM .data
	pSrc  = &__rom_etext;
	pDest = &__rom_data_start__;

	for (; pDest < &__rom_data_end__ ;) {
		*pDest++ = *pSrc++;
	}
#endif
}

SECTION_SYSSTART_TEXT
uint8_t chk_normal_mode_pg(void)
{
	char pg_get[3];
	uint8_t chk_fail_sts, pg_ptn_chk;
	uint32_t loopWait;
	uint32_t i;

