swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
	if (hal_rtl_uart_readable(&stdio_uart)) {

		loopWait = 500000;
		for (i = 0; i < 3; i++) {
			while ((!_stdio_port_getc(&pg_get[i])) && (loopWait != 0)) {
				loopWait--;
			}
			if (i == 0) {
				pg_ptn_chk = (uint8_t)(pg_get[i] ^ NORMAL_MODE_PG_PTN);
				//dbg_printf ("0 pg_ptn_chk 0x%x\r\n",pg_ptn_chk);
				if (pg_ptn_chk != 0x0) {
					chk_fail_sts++;
				} else {
					chk_fail_sts += 0;
				}
			} else if (i == 1) {
				pg_ptn_chk ^= (uint8_t)pg_get[i];
				//dbg_printf ("1 pg_ptn_chk 0x%x\r\n",pg_ptn_chk);
				if (pg_ptn_chk != NORMAL_MODE_PG_PTN) {
					chk_fail_sts++;
				} else {
					chk_fail_sts += 0;
				}
			} else {
				pg_ptn_chk ^= (uint8_t)pg_get[i];
				//dbg_printf ("2 pg_ptn_chk 0x%x\r\n",pg_ptn_chk);
				if (pg_ptn_chk != 0x0) {
					chk_fail_sts++;
				} else {
					chk_fail_sts += 0;
				}
			}
		}
		//dbg_printf ("chk_normal_mode_pg sts=0x%x\r\n",chk_fail_sts);
		if (chk_fail_sts > 0) {
			return DISABLE;
		} else {
			return ENABLE;
		}
	} else {
		return DISABLE;
	}
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void chk_img_to_ram_direct(uint32_t *pboot_mode)
{
	otp_boot_cfg_t *potp_boot_cfg = otpBootCfg;
	if (uboot_frame_handle.ram_start_tbl != 0) {
		PRAM_FUNCTION_START_TABLE pTempRamStartFun;

		pTempRamStartFun = (PRAM_FUNCTION_START_TABLE)uboot_frame_handle.ram_start_tbl;

		// simple signature check
		if (!chk_ram_img_signature(pTempRamStartFun->Signature)) {
			*pboot_mode = BootFromTestModeUART;
			pRamStartFun = (PRAM_FUNCTION_START_TABLE)uboot_frame_handle.ram_start_tbl;
		}
	} else {
		//dbg_printf("uboot_frame_handle.ram_start_table is NULL!!\r\n");
		//*pboot_mode = BootFromFlash;
		*pboot_mode = potp_boot_cfg->byte.cfg1.bit.boot_comm.boot_sel;
	}
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void timer_init_rom(void)
{
	// Start a G-Timer as system tick
	hal_rtl_timer_clock_init(1, ENABLE);
	hal_rtl_timer_group_init(&_timer_group1, 1); // time group 1
	hal_rtl_timer_group_sclk_sel(&_timer_group1, GTimerSClk_4M);   // Group1 Sclk:4M
	hal_rtl_misc_start_systimer(&_system_timer, CONFIG_SYS_TIMER_ID, GTimerCountUp, CONFIG_SYS_TICK_TIME, 1);
#if 0
#if defined(CONFIG_BUILD_SECURE)
	// share the G-Timer with NS
	*symb_ns4s_stubs->ppsystem_timer = &_system_timer;
#endif

#endif
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void pinmux_init_rom(void)
{
	_pinmux_manager.pin_reg_func = hal_rtl_pin_register;
	_pinmux_manager.pin_unreg_func = hal_rtl_pin_unregister;
	_pinmux_manager.pin_mux_cfg_func = hal_rtl_pin_mux_cfg;
	_pinmux_manager.ioport_pwrup_ctrl_func = hal_rtl_pin_pwrup;
	_pinmux_manager.ioport_pwrdn_ctrl_func = hal_rtl_pin_pwrdwn;
	_pinmux_manager.pin_validat_func = NULL;
	_pinmux_manager.ppinmux_reg_rec = NULL;
	hal_rtl_pinmux_manager_init(&_pinmux_manager);
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void wdt_init_rom(void)
{
	// VNDR wdt init setting
	hal_rtl_wdt_reset(0x17);   // If reset, need to clear  AON/ PON/ WLON/ SYSON block
	hal_rtl_wdt_init(10000000);  // 10sec
	hal_rtl_wdt_enable();
}

#if CONFIG_FPGA
// Simulate writing of S/NS Vendor Key to VNDR_S for Secure JTAG Non-Fixed Key Mode

const uint8_t vndr_s_jtag_key[32] = { // secure key; non-fixed key mode
	0xAA, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07,
	0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F,
	0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17,
	0x18, 0x19, 0x1A, 0x1B, 0x1C, 0x1D, 0x1E, 0x1F

	/*0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
	0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
	0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
	0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF*/
};

const uint8_t vndr_ns_jtag_key[32] = { // non-secure key; non-fixed key mode
	0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27,
	0x28, 0x29, 0x2A, 0x2B, 0x2C, 0x2D, 0x2E, 0x2F,
	0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37,
	0x38, 0x39, 0x3A, 0x3B, 0x3C, 0x3D, 0x3E, 0x3F
};

// Start: Declare test functions for Secure JTAG Non-Fixed Key Mode
void non_fixed_secure_jtag_test(void)
{

	// Not going via bootloader; write to VNDR reg directly here for testing purposes.
	hal_rtl_vdr_s_jtag_key_write((uint8_t *)vndr_s_jtag_key);

	// Bypass OTP autoload - manually write to AON register
	HAL_WRITE32(0x40009000, 0xBC, 0x1F4F); // Bit [7:6] = 2'b01 - Password Secure World Enable
}

void non_fixed_non_secure_jtag_test(void)
{

	// Not going via bootloader; write to VNDR reg directly here for testing purposes.
	hal_rtl_vdr_ns_jtag_key_write((uint8_t *)vndr_ns_jtag_key);

	// Bypass OTP autoload - manually write to AON register
	HAL_WRITE32(0x40009000, 0xBC, 0x1DCF); // Bit [9:8] = 2'b01 - Password Non-Secure World Enable
}

void non_fixed_secure_cum_non_secure_jtag_test(void)
{

	// Not going via bootloader; write to VNDR reg directly here for testing purposes.
	hal_rtl_vdr_s_jtag_key_write((uint8_t *)vndr_s_jtag_key);
	hal_rtl_vdr_ns_jtag_key_write((uint8_t *)vndr_ns_jtag_key);

	// Bypass OTP autoload - manually write to AON register
	HAL_WRITE32(0x40009000, 0xBC, 0x1D4F); // Bit [7:6] = 2'b01; Bit [9:8] = 2'b01 - Password Secure/Non-Secure World Enable
}

#endif

#if CONFIG_FPGA
#if CONFIG_BOOT_OTP_SIMU_AUTO_EN
// OTP load simulation related codes only for FPGA

#define OTP_ROM_SIMU_ID_0               (0x35)
#define OTP_ROM_SIMU_ID_1               (0x87)
#define OTP_ROM_SIMU_SIZE               (144)

SECTION_SYSSTART_BSS uint8_t vry_lgl_data_buf[OTP_ROM_SIMU_SIZE];
SECTION_SYSSTART_BSS uint8_t vry_phy_data_buf[OTP_ROM_SIMU_SIZE];

const uint8_t otp_rma0_ptn[RMA0_PTN_SIZE] = {
	0xFE, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0
};

const uint8_t otp_rotpk_hsh_ptn[3][SB_PBK_HASH_SIZE] = {
	{
		0xae, 0xc1, 0x16, 0x6f, 0xba, 0x2b, 0xfe, 0x8d,
		0x48, 0x71, 0x67, 0xc9, 0x8b, 0x57, 0x8d, 0xa9,
		0x46, 0x4c, 0x01, 0x72, 0xcb, 0x8e, 0x06, 0x4f,
		0x8c, 0xf7, 0x85, 0x30, 0xd1, 0xac, 0x9e, 0x90
	},
	{
		0xb3, 0x8b, 0x61, 0x33, 0x4c, 0x0d, 0x9e, 0xe1,
		0x25, 0xf4, 0x28, 0x05, 0xbd, 0xdd, 0xdd, 0xc8,
		0x91, 0xfe, 0x82, 0x91, 0x96, 0xdf, 0x43, 0xf2,
		0x20, 0x3a, 0x99, 0x32, 0x56, 0x30, 0xf4, 0x1d
	},
	{
		0xae, 0xc1, 0x16, 0x6f, 0xba, 0x2b, 0xfe, 0x8d,
		0x48, 0x71, 0x67, 0xc9, 0x8b, 0x57, 0x8d, 0xa9,
		0x46, 0x4c, 0x01, 0x72, 0xcb, 0x8e, 0x06, 0x4f,
		0x8c, 0xf7, 0x85, 0x30, 0xd1, 0xac, 0x9e, 0x90
	},
};
const uint8_t otp_huk_ptn[3][SB_HUK_SIZE] = {
	{
		0xcd, 0xe3, 0xc1, 0xf5, 0x5f, 0xc1, 0xa7, 0x01,
		0x43, 0x3f, 0xf0, 0x20, 0x34, 0xbd, 0xc9, 0xdc,
		0x6a, 0x1e, 0xda, 0x4f, 0x63, 0x7c, 0x26, 0x7e,
		0xe3, 0x19, 0x32, 0xe8, 0x3a, 0x99, 0x69, 0x5e
	},
	{
		0xc5, 0x6f, 0xbf, 0x14, 0xb7, 0x96, 0x95, 0xf9,
		0x19, 0x81, 0xdc, 0x44, 0x10, 0x54, 0x7e, 0x4f,
		0x5f, 0x54, 0xf9, 0xa9, 0x2c, 0x9c, 0x4d, 0x67,
		0x07, 0x13, 0x19, 0xba, 0x28, 0x9a, 0x01, 0xc7
	},
	{
		0xcd, 0xe3, 0xc1, 0xf5, 0x5f, 0xc1, 0xa7, 0x01,
		0x43, 0x3f, 0xf0, 0x20, 0x34, 0xbd, 0xc9, 0xdc,
		0x6a, 0x1e, 0xda, 0x4f, 0x63, 0x7c, 0x26, 0x7e,
		0xe3, 0x19, 0x32, 0xe8, 0x3a, 0x99, 0x69, 0x5e
	},
};

const uint8_t otp_sec_key_ptn[3][SB_SEC_KEY_SIZE] = {
	{
		0x10, 0x86, 0xb3, 0x32, 0x8e, 0x21, 0xe6, 0xcb,
		0x73, 0xa1, 0x13, 0x77, 0x10, 0x29, 0xa3, 0x91,
		0xa4, 0x08, 0x78, 0x02, 0xc5, 0x8c, 0x73, 0xb4,
		0x01, 0x1b, 0x3a, 0x4a, 0xc6, 0x7f, 0x38, 0x0e
	},
	{
		0x7f, 0x82, 0xe5, 0x2a, 0x00, 0xbb, 0x47, 0x1c,
		0x24, 0xa7, 0xb9, 0x64, 0xb4, 0xfc, 0xeb, 0x7f,
		0x8b, 0x39, 0x2a, 0x19, 0xf8, 0x82, 0xe1, 0x7f,
		0x64, 0xab, 0x60, 0x53, 0x35, 0x93, 0xdd, 0x83
	},
	{
		0x10, 0x86, 0xb3, 0x32, 0x8e, 0x21, 0xe6, 0xcb,
		0x73, 0xa1, 0x13, 0x77, 0x10, 0x29, 0xa3, 0x91,
		0xa4, 0x08, 0x78, 0x02, 0xc5, 0x8c, 0x73, 0xb4,
		0x01, 0x1b, 0x3a, 0x4a, 0xc6, 0x7f, 0x38, 0x0e
	},
};

const uint8_t otp_s_jtag_key_ptn[2][SB_SJTAG_KEY_SIZE] = { // secure key 1; fixed key mode // NOTE!! starting is 0xDD NOTE!!
	{
		0xDD, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07,
		0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F,
		0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17,
		0x18, 0x19, 0x1A, 0x1B, 0x1C, 0x1D, 0x1E, 0x1F
	},
	{
		0xDE, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07,
		0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F,
		0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17,
		0x18, 0x19, 0x1A, 0x1B, 0x1C, 0x1D, 0x1E, 0x1F
	}
};

const uint8_t otp_ns_jtag_key_ptn[2][SB_SJTAG_KEY_SIZE] = { // non-secure key 1; fixed key mode // NOTE!! ending is 0x40 NOTE!!
	{
		0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27,
		0x28, 0x29, 0x2A, 0x2B, 0x2C, 0x2D, 0x2E, 0x2F,
		0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37,
		0x38, 0x39, 0x3A, 0x3B, 0x3C, 0x3D, 0x3E, 0x40
	},
	{
		0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27,
		0x28, 0x29, 0x2A, 0x2B, 0x2C, 0x2D, 0x2E, 0x2F,
		0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37,
		0x38, 0x39, 0x3A, 0x3B, 0x3C, 0x3D, 0x3E, 0x41
	}
};

