swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
const uint8_t otp_adc_param_ptn[10] = {
	0x12, 0x34, 0x56, 0x78, 0x9A, 0xBC, 0xDE, 0x87,
	0x3B, 0x5A
};


SECTION_SYSSTART_TEXT
void otp_rom_simu_dump_map(uint8_t *mem_buf)
{
	int j;
	dbg_printf("------------- Dump otp_map -------------\r\n");
	for (j = 0; j < OTP_ROM_SIMU_SIZE; j = j + 16) {
		dbg_printf("[addr:0x%03x] %02x %02x %02x %02x %02x %02x %02x %02x  %02x %02x %02x %02x %02x %02x %02x %02x\r\n",
				   j, mem_buf[0 + j], mem_buf[1 + j], mem_buf[2 + j], mem_buf[3 + j], mem_buf[4 + j], mem_buf[5 + j], mem_buf[6 + j], mem_buf[7 + j],
				   mem_buf[8 + j], mem_buf[9 + j], mem_buf[10 + j], mem_buf[11 + j], mem_buf[12 + j], mem_buf[13 + j],
				   mem_buf[14 + j], mem_buf[15 + j]);
	}
	dbg_printf("\r\n");
}

SECTION_SYSSTART_TEXT
void otp_rom_simu_key_dump(uint32_t otp_addr, uint8_t *mem_buf)
{
	int j;
	dbg_printf("------------- Dump key -------------\r\n");
	for (j = 0; j < 32; j = j + 16) {
		dbg_printf("[addr:0x%03x] %02x %02x %02x %02x %02x %02x %02x %02x  %02x %02x %02x %02x %02x %02x %02x %02x\r\n",
				   (otp_addr + j), mem_buf[0 + j], mem_buf[1 + j], mem_buf[2 + j], mem_buf[3 + j], mem_buf[4 + j], mem_buf[5 + j], mem_buf[6 + j], mem_buf[7 + j],
				   mem_buf[8 + j], mem_buf[9 + j], mem_buf[10 + j], mem_buf[11 + j], mem_buf[12 + j], mem_buf[13 + j],
				   mem_buf[14 + j], mem_buf[15 + j]);
	}
	dbg_printf("\r\n");
}


SECTION_SYSSTART_TEXT
int32_t otp_rom_simu_fill_lgl_map(uint8_t *lgl_map_buf, uint32_t lgl_addr, uint8_t data)
{
	if (lgl_addr > 0x7FF) {
		return -1;
	} else if ((lgl_addr >= 0x000) && (lgl_addr <= 0x003)) {
		return 0;
	} else {
		if (((lgl_addr == 0x004) && (data != OTP_ROM_SIMU_ID_0)) ||
			((lgl_addr == 0x005) && (data != OTP_ROM_SIMU_ID_1))) {
			return -1;
		} else {
			lgl_map_buf[lgl_addr] = data;
			return 0;
		}
	}
}

SECTION_SYSSTART_TEXT
int32_t otp_rom_simu_lgl_buf_to_phy_eny(uint32_t strt_addr, uint8_t *lgl_map_buf, uint8_t *otp_mem_buf)
{
	/* log_map_buf should be a continuous 8 bytes buffer */
	uint32_t tmp_cnt;
	uint32_t lgl_off;
	uint8_t word_en;
	int32_t phy_eny_len;

	word_en = 0;
	phy_eny_len = 0;
	lgl_off = strt_addr / OTP_LGL_FULL_ENY_DAT_LEN;
	for (tmp_cnt = 0; tmp_cnt < OTP_LGL_WE_NUM; tmp_cnt++) {
		if ((*(lgl_map_buf + tmp_cnt * OTP_LGL_ONE_DAT_LEN) == 0xFF) &&
			(*(lgl_map_buf + tmp_cnt * OTP_LGL_ONE_DAT_LEN + 1) == 0xFF)) {
			// set WE to 1
			word_en |= (BIT0 << tmp_cnt);
		} else {
			phy_eny_len++;
		}
	}
	if ((word_en & 0xF) != 0xF) {
		/* create entry header prefix */
		*otp_mem_buf = (OTP_LGL_PFX_VAL << OTP_SHIFT_LGL_PFX);
		*otp_mem_buf |= ((lgl_off & OTP_LGL_OFFH_MSK) >> OTP_SHIFT_LGL_OFFH);
		*(otp_mem_buf + OTP_LGL_ENY_HDR0_OFF) = ((lgl_off & OTP_LGL_OFFL_MSK) << OTP_SHIFT_LGL_OFFL);

		/* use lgl_off to record otp mem data pointer */
		lgl_off = 0;
		*(otp_mem_buf + OTP_LGL_ENY_HDR0_OFF) |= word_en;
		for (tmp_cnt = 0; tmp_cnt < OTP_LGL_WE_NUM; tmp_cnt++) {
			if ((word_en & (BIT0 << tmp_cnt)) == 0) {
				/* copy data from logical to otp physical memory buffer */
				*(otp_mem_buf + OTP_LGL_ENY_DATA_OFF + lgl_off * OTP_LGL_ONE_DAT_LEN) =
					*(lgl_map_buf + tmp_cnt * OTP_LGL_ONE_DAT_LEN);
				*(otp_mem_buf + OTP_LGL_ENY_DATA_OFF + lgl_off * OTP_LGL_ONE_DAT_LEN + 1) =
					*(lgl_map_buf + tmp_cnt * OTP_LGL_ONE_DAT_LEN + 1);
				lgl_off++;
			}
		}
		/* calculate physical entry length and return it */
		phy_eny_len = OTP_LGL_ENY_DATA_OFF + phy_eny_len * OTP_LGL_ONE_DAT_LEN;
	}
	return phy_eny_len;
}

SECTION_SYSSTART_TEXT
int32_t otp_rom_simu_trans_lgl_map_to_otp_phy_map(uint8_t *lgl_map_buf, uint8_t *phy_map_buf)
{
	uint32_t tmp_cnt;
	uint32_t phy_idx;   /* logical index */
	int32_t phy_eny_len;   /* physical index */
	int32_t total_phy_len;
	uint8_t phy_eny_buf_tmp[OTP_LGL_ENTY_LEN];

	total_phy_len = 0;
	phy_idx = OTP_PHY_RSVD_LEN;
	for (tmp_cnt = 0; tmp_cnt < OTP_ROM_SIMU_SIZE; tmp_cnt += OTP_LGL_FULL_ENY_DAT_LEN) {
		_memset(&phy_eny_buf_tmp[0], 0xFF, OTP_LGL_ENTY_LEN);

		phy_eny_len = otp_rom_simu_lgl_buf_to_phy_eny(tmp_cnt, (lgl_map_buf + tmp_cnt), &phy_eny_buf_tmp[0]);
		/* copy physical entry into physical map buffer */
		//copy data to physical map
		_memcpy((phy_map_buf + phy_idx), &phy_eny_buf_tmp[0], phy_eny_len);
		phy_idx += phy_eny_len;
		total_phy_len += phy_eny_len;
	}
	return total_phy_len;
}

SECTION_SYSSTART_TEXT
void otp_pg_rma0_pattern()
{
	uint32_t rma_ptn_buf[RMA0_PTN_SIZE];
	uint8_t *p_ptn_buf = NULL, *p_high_val_ptn = NULL;;
	uint32_t otp_idx, rma_high_val_addr = RMA0_PTN_BASE_ADDR;
	uint8_t otp_not_burn = 0, rma_high_val_size = RMA0_PTN_SIZE;

	p_ptn_buf = &rma_ptn_buf[0];
	_memset(p_ptn_buf, 0xFF, rma_high_val_size);
	p_high_val_ptn = &otp_rma0_ptn[0];

	// Get High value assets from OTP
	for (otp_idx = 0; otp_idx < rma_high_val_size; otp_idx++) {
		p_ptn_buf[otp_idx] = hal_rtl_otp_byte_rd_syss((rma_high_val_addr + otp_idx));
		if ((p_ptn_buf[otp_idx] != p_high_val_ptn[otp_idx]) && (p_ptn_buf[otp_idx] == 0xFF)) {
			otp_not_burn++;
		}
	}

	if ((rma_high_val_size / 2) < otp_not_burn) {
		for (otp_idx = 0; otp_idx < rma_high_val_size; otp_idx++) {
			//hal_rtl_otp_byte_wr_syss((rma_high_val_addr + otp_idx), p_high_val_ptn[otp_idx]);
			hal_rtl_otp_byte_wr_marr_syss((rma_high_val_addr + otp_idx), p_high_val_ptn[otp_idx], DISABLE);
		}
	}
}

SECTION_SYSSTART_TEXT
void otp_pg_key_patterns(uint8_t sb_high_val_obj)
{
	uint32_t otp_idx, i;
	uint8_t otp_not_burn = 0, idx_start, idx_end, sb_high_val_size;
	uint32_t sb_high_val_addr, sb_high_val_base, sb_high_val_rma_base;
	uint32_t key_buf[32];
	uint8_t *p_key_buf = NULL, *p_high_val_ptn = NULL;

	switch (sb_high_val_obj) {
	case SB_HIGH_VAL_RTOPK_HSH:
		idx_start = SB_HIGH_VAL_IDX1;
		idx_end   = SB_HIGH_VAL_RMA_IDX;
		sb_high_val_base     = ROTPK_HSH_OTP_BASE_ADDR;
		sb_high_val_rma_base = ROTPK_HSH_RMA_OTP_BASE_ADDR;
		sb_high_val_size     = SB_PBK_HASH_SIZE;
		p_high_val_ptn       = &otp_rotpk_hsh_ptn[0][0];
		break;
	case SB_HIGH_VAL_HUK:
		idx_start = SB_HIGH_VAL_IDX1;
		idx_end   = SB_HIGH_VAL_RMA_IDX;
		sb_high_val_base     = HUK_OTP_BASE_ADDR;
		sb_high_val_rma_base = HUK_RMA_OTP_BASE_ADDR;
		sb_high_val_size     = SB_HUK_SIZE;
		p_high_val_ptn       = &otp_huk_ptn[0][0];
		break;
	case SB_HIGH_VAL_SEC_KEY:
		idx_start = SB_HIGH_VAL_IDX1;
		idx_end   = SB_HIGH_VAL_RMA_IDX;
		sb_high_val_base     = SEC_KEY_OTP_BASE_ADDR;
		sb_high_val_rma_base = SEC_KEY_RMA_OTP_BASE_ADDR;
		sb_high_val_size     = SB_SEC_KEY_SIZE;
		p_high_val_ptn       = &otp_sec_key_ptn[0][0];
		break;
	case SB_HIGH_VAL_SJTAG_S_KEY:
		idx_start = SB_HIGH_VAL_IDX1;
		idx_end   = SB_HIGH_VAL_IDX2;
		sb_high_val_base     = SJTAG_S_KEY_OTP_BASE_ADDR;
		sb_high_val_rma_base = 0x0;
		sb_high_val_size     = SB_SJTAG_KEY_SIZE;
		p_high_val_ptn       = &otp_s_jtag_key_ptn[0][0];
		break;
	case SB_HIGH_VAL_SJTAG_NS_KEY:
		idx_start = SB_HIGH_VAL_IDX1;
		idx_end   = SB_HIGH_VAL_IDX2;
		sb_high_val_base     = SJTAG_NS_KEY_OTP_BASE_ADDR;
		sb_high_val_rma_base = 0x0;
		sb_high_val_size     = SB_SJTAG_KEY_SIZE;
		p_high_val_ptn       = &otp_s_jtag_key_ptn[0][0];
		break;
	default:
		goto otp_pg_key_patterns_end;
		break;
	}

	for (i = idx_start; i <= idx_end; i++) {
		otp_not_burn = 0;
		if (SB_HIGH_VAL_IDX1 == i) {
			sb_high_val_addr = (sb_high_val_base + 0x0);
		} else if (SB_HIGH_VAL_IDX2 == i) {
			sb_high_val_addr = (sb_high_val_base + sb_high_val_size);
		} else {
			sb_high_val_addr = sb_high_val_rma_base;
		}
		p_key_buf = &key_buf[0];
		_memset(p_key_buf, 0xFF, sb_high_val_size);
		// Get High value assets from OTP
		for (otp_idx = 0; otp_idx < sb_high_val_size; otp_idx++) {
			p_key_buf[otp_idx] = hal_rtl_otp_byte_rd_syss((sb_high_val_addr + otp_idx));
			if ((p_key_buf[otp_idx] != p_high_val_ptn[((i - 1)*sb_high_val_size) + otp_idx]) && (p_key_buf[otp_idx] == 0xFF)) {
				otp_not_burn++;
			}
		}

		if ((sb_high_val_size / 2) < otp_not_burn) {
			for (otp_idx = 0; otp_idx < sb_high_val_size; otp_idx++) {
				//hal_rtl_otp_byte_wr_syss((sb_high_val_addr + otp_idx), p_high_val_ptn[((i - 1)*sb_high_val_size) + otp_idx]);
				hal_rtl_otp_byte_wr_marr_syss((sb_high_val_addr + otp_idx), p_high_val_ptn[((i - 1)*sb_high_val_size) + otp_idx], DISABLE);
			}
		}
#if 0
		// Dbg otp High value assets
		for (otp_idx = 0; otp_idx < sb_high_val_size; otp_idx++) {
			p_key_buf[otp_idx] = hal_rtl_otp_byte_rd_syss((sb_high_val_addr + otp_idx));
		}
		otp_rom_simu_key_dump(sb_high_val_addr, p_key_buf);
#endif
	}
otp_pg_key_patterns_end:
	return;
}

SECTION_SYSSTART_TEXT
void otp_adc_param_patterns()
{
	uint32_t otp_idx, i;
	uint8_t otp_not_burn = 0;
	uint32_t adc_param_buf[10];
	uint8_t *p_adc_param_buf = NULL, *p_high_val_ptn = NULL;;
	p_high_val_ptn = &otp_adc_param_ptn[0];
	p_adc_param_buf = &adc_param_buf[0];
	_memset(p_adc_param_buf, 0xFF, 10);
	for (otp_idx = 0; otp_idx < 10; otp_idx++) {
		p_adc_param_buf[otp_idx] = hal_rtl_otp_byte_rd_syss((HP_ADC_GAIN_DENO_ADDR + otp_idx));
		if ((p_adc_param_buf[otp_idx] != p_high_val_ptn[otp_idx]) && (p_adc_param_buf[otp_idx] == 0xFF)) {
			otp_not_burn++;
		}
	}

