swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
	if ((10 / 2) < otp_not_burn) {
		for (otp_idx = 0; otp_idx < 10; otp_idx++) {
			hal_rtl_otp_byte_wr_marr_syss((HP_ADC_GAIN_DENO_ADDR + otp_idx), p_high_val_ptn[otp_idx], DISABLE);
		}
	}
}

SECTION_SYSSTART_TEXT
void otp_load_simulation_rom(uint8_t *p_autoload_not_set)
{
	otp_boot_cfg1_t otp_boot_cfg1_info;
	otp_boot_cfg2_t otp_boot_cfg2_info;
	otp_boot_cfg3_t otp_boot_cfg3_info;
	otp_boot_cfg4_t otp_boot_cfg4_info;
	uint8_t *vry_lgl_data = &vry_lgl_data_buf[0];
	uint8_t *vry_phy_data = &vry_phy_data_buf[0];
	uint8_t otp_val = 0xFF, otp_not_burn = 0;
	uint32_t otp_idx, i;
	int32_t total_phy_burn_len;

	_memset(vry_lgl_data, 0xFF, OTP_ROM_SIMU_SIZE);
	_memset(vry_phy_data, 0xFF, OTP_ROM_SIMU_SIZE);

	/* fill in OTP logical map */
	otp_rom_simu_fill_lgl_map(vry_lgl_data,  0x4, OTP_ROM_SIMU_ID_0);
	otp_rom_simu_fill_lgl_map(vry_lgl_data,  0x5, OTP_ROM_SIMU_ID_1);

	otp_boot_cfg1_info.byte = 0;
	otp_boot_cfg1_info.bit.boot_comm.boot_sel = BootFromNORFlash;
	//otp_boot_cfg1_info.bit.boot_comm.boot_sel = BootFromUART;
	otp_rom_simu_fill_lgl_map(vry_lgl_data, OTPBootCfg1_LOGL_Offset, otp_boot_cfg1_info.byte);

	otp_boot_cfg2_info.byte = 0;
	otp_boot_cfg2_info.bit.boot_rom_dbg_msg_dis = BootDbgMsgOn;
	otp_boot_cfg2_info.bit.rom_log_port_sel = BootDbgUART1;
	otp_boot_cfg2_info.bit.rom_log_rx_pin_sel = BootUART_S0;
	otp_boot_cfg2_info.bit.rom_log_tx_pin_sel = BootUART_S0;
	otp_rom_simu_fill_lgl_map(vry_lgl_data, OTPBootCfg2_LOGL_Offset, otp_boot_cfg2_info.byte);

	otp_boot_cfg3_info.byte = 0;
#if LOAD_FLAH_IMG_NEW_FORMAT_IMGHSH_EN
	otp_boot_cfg3_info.bit.img_hsh_en = ENABLE;
#else
	otp_boot_cfg3_info.bit.img_hsh_en = DISABLE;
#endif

#if LOAD_FLAH_IMG_NEW_FORMAT_TB_EN
	otp_boot_cfg3_info.bit.tb_en = ENABLE;
#else
	otp_boot_cfg3_info.bit.tb_en = DISABLE;
#endif

#if LOAD_FLAH_IMG_NEW_FORMAT_SB_EN
	otp_boot_cfg3_info.bit.sb_en = ENABLE;
#else
	otp_boot_cfg3_info.bit.sb_en = DISABLE;
#endif
	otp_rom_simu_fill_lgl_map(vry_lgl_data, OTPBootCfg3_LOGL_Offset, otp_boot_cfg3_info.byte);

	// Debug port select(Default set TM using SW0, S0 for SWD IO pin & CLK pin)
	otp_boot_cfg4_info.byte = 0;
	otp_boot_cfg4_info.bit.dbg_port_mod_sel = DbgPorSWD;
	//otp_boot_cfg4_info.bit.dbg_port_mod_sel = DbgPorJTag;     // secure jtag need to set this
	otp_boot_cfg4_info.bit.dbg_port_tms_io_pin_sel = DbgPort_pin_S0;
	otp_boot_cfg4_info.bit.dbg_port_clk_pin_sel = DbgPort_pin_S0;
	otp_rom_simu_fill_lgl_map(vry_lgl_data, OTPBootCfg4_LOGL_Offset, otp_boot_cfg4_info.byte);

#if 1
	otp_boot_cfg5_t otp_boot_cfg5_info;
	// Enable Normal mode SIC
	otp_boot_cfg5_info.byte = 0;
	otp_boot_cfg5_info.bit.boot_normal_sic_en = DISABLE;
	otp_rom_simu_fill_lgl_map(vry_lgl_data, OTPBootCfg5_LOGL_Offset, otp_boot_cfg5_info.byte);

	otp_rom_simu_fill_lgl_map(vry_lgl_data, OTPBootCfg6_LOGL_Offset, 0x1E); // A-cut default val
#endif

	otp_boot_cfg7_t otp_boot_cfg7_info;
	// Enable Control NON-TLV IMG format load, fcs ROM flow disable control
	otp_boot_cfg7_info.byte = 0;
	//otp_boot_cfg7_info.bit.rom_dcache_dis = ENABLE;
#if LOAD_FLAH_IMG_NEW_FORMAT
	otp_boot_cfg7_info.bit.ntlv_img_ld_en = DISABLE;
#else
	otp_boot_cfg7_info.bit.ntlv_img_ld_en = ENABLE;
#endif

#if CONFIG_BOOT_LD_VOE_CTRL
	otp_boot_cfg7_info.bit.fcs_rom_flow_dis = DISABLE;
#else
	otp_boot_cfg7_info.bit.fcs_rom_flow_dis = ENABLE;
#endif
	otp_rom_simu_fill_lgl_map(vry_lgl_data, OTPBootCfg7_LOGL_Offset, otp_boot_cfg7_info.byte);

	otp_rom_simu_fill_lgl_map(vry_lgl_data, OTPBootCfg8_LOGL_Offset, 0x0); // A-cut default val

#if 0
	// Dbg otp logical map, make sure UART already init!!!
	dbg_printf("Logical map fill:\r\n");
	otp_rom_simu_dump_map(vry_lgl_data);
#endif
	/* transform from logical to physical OTP map */
	total_phy_burn_len = otp_rom_simu_trans_lgl_map_to_otp_phy_map(vry_lgl_data, vry_phy_data);
#if 0
	// Dbg otp physical map, make sure UART already init!!!
	dbg_printf("Physical map fill:\r\n");
	otp_rom_simu_dump_map(vry_phy_data);
#endif

	//dbg_printf("total_phy_burn_len = %u\r\n",total_phy_burn_len);
	// 1st boot, OTP did not burn value;
	hal_rtl_otp_init();
	otp_val = hal_rtl_otp_byte_rd_syss(0x6);
	if ((otp_val != 0x35) && (otp_val == 0xFF)) {
		otp_not_burn++;
	}
	otp_val = hal_rtl_otp_byte_rd_syss(0x7);
	if ((otp_val != 0x87) && (otp_val == 0xFF)) {
		otp_not_burn++;
	}
	if (otp_not_burn > 0) {
		for (otp_idx = OTP_PHY_RSVD_LEN; otp_idx < OTP_PHY_RSVD_LEN + total_phy_burn_len; otp_idx++) {
			//hal_rtl_otp_byte_wr_syss(otp_idx, vry_phy_data[otp_idx]);
			hal_rtl_otp_byte_wr_marr_syss(otp_idx, vry_phy_data[otp_idx], DISABLE);
		}
		*p_autoload_not_set = ENABLE;
	}

	// write rma0 ptn
#if LOAD_RMA0_PTN_EN
	otp_pg_rma0_pattern();
#endif

	// write ROTPK HSH
	otp_pg_key_patterns(SB_HIGH_VAL_RTOPK_HSH);

	// write HUK
	otp_pg_key_patterns(SB_HIGH_VAL_HUK);

	// write SEC Keys
	otp_pg_key_patterns(SB_HIGH_VAL_SEC_KEY);

	// write SJTAG OTP AON Ctrl
#if 0
	otp_not_burn = 0;
	otp_val = hal_rtl_otp_byte_rd_syss(0x0);
	if ((otp_val != 0x5F) && (otp_val == 0xFF)) {
		otp_not_burn++;
	}
	otp_val = hal_rtl_otp_byte_rd_syss(0x1);
	if ((otp_val != 0xFD) && (otp_val == 0xFF)) {
		otp_not_burn++;
	}
	if (otp_not_burn > 0) {
		hal_rtl_otp_byte_wr_marr_syss(0x0, 0x5F, DISABLE);  // 0x5F NF Key S world pw en, 0x7F Fixed Key S world pw en
		hal_rtl_otp_byte_wr_marr_syss(0x1, 0xFD, DISABLE);  // 0xFD NS world pw en
	}

	// write SJTAG Keys
	otp_pg_key_patterns(SB_HIGH_VAL_SJTAG_S_KEY);
	otp_pg_key_patterns(SB_HIGH_VAL_SJTAG_NS_KEY);
#endif

	// write ADC PARAM ptn
	otp_adc_param_patterns(SB_HIGH_VAL_RTOPK_HSH);

	hal_rtl_otp_deinit();
}
#endif

SECTION_SYSSTART_TEXT
__STATIC_INLINE void autold_fail_self_cfg(void)
{
	otp_boot_cfg_t *potp_boot_cfg = otpBootCfg;
	otp_boot_cfg7_t *potp_boot_cfg7 = otpBootCfg7;

	if (ENABLE != hal_rtl_otp_rd_al_sts(OTPAlAonSts)) {
#if LOAD_FLAH_IMG_NEW_FORMAT_IMGHSH_EN
		potp_boot_cfg->byte.cfg3.bit.img_hsh_en = ENABLE;
#else
		potp_boot_cfg->byte.cfg3.bit.img_hsh_en = DISABLE;
#endif

#if LOAD_FLAH_IMG_NEW_FORMAT_TB_EN
		potp_boot_cfg->byte.cfg3.bit.tb_en = ENABLE;
#else
		potp_boot_cfg->byte.cfg3.bit.tb_en = DISABLE;
#endif

#if LOAD_FLAH_IMG_NEW_FORMAT_SB_EN
		potp_boot_cfg->byte.cfg3.bit.sb_en = ENABLE;
#else
		potp_boot_cfg->byte.cfg3.bit.sb_en = DISABLE;
#endif

#if LOAD_FLAH_IMG_NEW_FORMAT
		potp_boot_cfg7->bit.ntlv_img_ld_en = DISABLE;
#else
		potp_boot_cfg7->bit.ntlv_img_ld_en = ENABLE;
#endif

