swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
#if CONFIG_BOOT_LD_VOE_CTRL
		potp_boot_cfg7->bit.fcs_rom_flow_dis = DISABLE;
#else
		potp_boot_cfg7->bit.fcs_rom_flow_dis = ENABLE;
#endif
	}
}
#endif

SECTION_SYSSTART_TEXT
__STATIC_INLINE void otp_pg_rma1_mgn()
{
	uint32_t rma_ptn_buf[RMA1_MGN_PTN_SIZE];
	uint8_t *p_ptn_buf = NULL, *p_high_val_ptn = NULL;;
	uint32_t otp_idx, rma_high_val_addr = RMA1_MGNPTN_BASE_ADDR;
	uint8_t otp_not_burn = 0, rma_high_val_size = RMA1_MGN_PTN_SIZE;

	hal_rtl_otp_init();

	// PG enable
#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
	hal_rtl_sys_en_rma_mgn_pg();
#endif

	p_ptn_buf = &rma_ptn_buf[0];
	_memset(p_ptn_buf, 0xFF, rma_high_val_size);
	p_high_val_ptn = &otp_rma1_mgn[0];

	// Get High value assets from OTP
	for (otp_idx = 0; otp_idx < rma_high_val_size; otp_idx++) {
		p_ptn_buf[otp_idx] = hal_rtl_otp_byte_rd_syss((rma_high_val_addr + otp_idx));
		if ((p_ptn_buf[otp_idx] != p_high_val_ptn[otp_idx]) && (p_ptn_buf[otp_idx] == 0xFF)) {
			otp_not_burn++;
		}
	}

	if ((rma_high_val_size / 2) < otp_not_burn) {
		for (otp_idx = 0; otp_idx < rma_high_val_size; otp_idx++) {
			//hal_rtl_otp_byte_wr_syss((rma_high_val_addr + otp_idx), p_high_val_ptn[otp_idx]);
			hal_rtl_otp_byte_wr_marr_syss((rma_high_val_addr + otp_idx), p_high_val_ptn[otp_idx], DISABLE);
		}
	}

#if 0
	// dbg rma1 ptn
	for (otp_idx = 0; otp_idx < rma_high_val_size; otp_idx++) {
		p_ptn_buf[otp_idx] = hal_rtl_otp_byte_rd_syss((rma_high_val_addr + otp_idx));
		dbg_printf("0x%x ", *(p_ptn_buf + otp_idx));
	}
	dbg_printf("\r\n");
#endif

	hal_rtl_otp_deinit();
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE uint8_t chk_op_rma_flow()
{
	uint8_t rma_state = RMA_NORMAL_STATE;
	int vrf_sts = FAIL;
	// Get RMA state
#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
	rma_state = hal_rtl_sys_get_rma_state();
#endif

	if (RMA_NORMAL_STATE == rma_state) {
		goto chk_op_rma_flow_end;
	} else if (RMA_STATE0 == rma_state) {
		/*
		    prepare enter rma1
		    1. UART init check (todo)
		    2. WDT all disable (todo)
		    3. Wait for get pbk ptn (todo)

		    go enter rma1
		    1. use pbk ptn vrf related rma keys signature (todo)
		    2. write enable & pg mgn ptn (done)
		    3. WDT enable [option](todo)
		*/
		dbg_printf("[RMA_STATE0]\r\n");
		// wdt(AON/VNDR) disable
		hal_rtl_wdt_ctrl_all_disable();
		vrf_sts = SUCCESS;
		if (SUCCESS == vrf_sts) {
			otp_pg_rma1_mgn();
		}
		hal_rtl_wdt_ctrl_aon_enable();
	} else if (RMA_STATE1 == rma_state) {
		/*
		    go enter rma2
		    1. chk uuid

		    if (uuid not burn)

		    else (uuid burn, set inv(uuid))

		    final get rma state
		*/
		dbg_printf("[RMA_STATE1]\r\n");
	}

	if ((RMA_STATE1 == rma_state) ||
		(RMA_STATE2 == rma_state)) {
		/*
		    OTP secure & super secure zone lock ctrl enable
		    - SSZ RMA lock
		    - SZ RMA lock
		*/

	}
chk_op_rma_flow_end:
	return rma_state;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void pwr_seq(void)
{
#if 0
	// Power flow workaround
	HAL_WRITE32(0x400090B4, 0x0, 0xFFE);    // Disable WDT --> move to Bootloader
	HAL_WRITE32(0x40009008, 0x0, 0x2);      // Enable PON block (AON_SYS_PON_FEN) from AON --> HW bootflow
	HAL_WRITE32(0x4000982C, 0x0, 0x307);    // Enable UART0 Sclock (SCLK_UART0_EN) & pclock (PCLK_UART0_EN) on PON_REG --> HW bootflow
	// Enable TIMER0 Sclock (SCLK_TIMER0_EN) & pclock (PCLK_TIMER0_EN) on PON_REG
	// Enable UART Bus domain (UART0_BD_EN) on PON_REG
	HAL_WRITE32(0x40009800, 0x0, 0x1FFFF);  // CPU and platform config + enable SYSON from PON --> HW bootflow
#endif
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void rom_info_store(void)
{
	/*
	  AON 0x4000_90C8[7:4] -> Main Number
	  AON 0x4000_90C8[3:0] -> Sub Number
	 */
	AON_TypeDef *aon = AON;
	volatile uint32_t reg_val;
	reg_val = aon->AON_REG_AON_SYS_INFO1;
	reg_val &= (~AON_MASK_SYSCFG_ROM_INFO);
	aon->AON_REG_AON_SYS_INFO1 = (reg_val | (((ROM_VER_MAIN << 4) & 0xF0) | (ROM_VER_SUB & 0xF)));
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void vendor_init(void)
{
	/*
	    Enable vendor register clock:PON 0x4000_9800[5]
	    Enable vendor registers : PON 0x4000_9800[6]
	 */
	PON_TypeDef *pon = PON;
	volatile uint32_t reg_val;
	reg_val = pon->PON_REG_PON_SYSON_CTRL;
	reg_val |= PON_BIT_VENDOR_CLK_EN;
	pon->PON_REG_PON_SYSON_CTRL = reg_val;

	reg_val = (pon->PON_REG_PON_SYSON_CTRL);
	reg_val |= PON_BIT_VENDOR_REG_EN;
	pon->PON_REG_PON_SYSON_CTRL = reg_val;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void pon_sram_init(void)
{
	/*
	    PON SRAM Normal Mode:PON 0x4000_983C[3:0]
	    OSC 128K LDO ON
	 */
	PON_TypeDef *pon = PON;
	AON_TypeDef *aon = AON;
	pon->PON_REG_PON_BUS_CTRL = 0;
	//aon->AON_REG_AON_OSC32K_CTRL0 &= ~(AON_BIT_POW_OSC32K);
	aon->AON_REG_AON_OSC32K_CTRL0 |= AON_BIT_POW_OSC32K;
	aon->AON_REG_AON_CLK_CTRL |= AON_BIT_REG_CLK_SEL;
	aon->AON_REG_AON_CLK_CTRL |= AON_BIT_INT_CLK_SEL;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE uint32_t get_test_mode_status(void)
{
	AON_TypeDef *aon = AON;
	volatile uint32_t reg_val;
	uint8_t test_mode_status;
	reg_val = aon->AON_REG_AON_SYS_INFO1;
	test_mode_status = ((reg_val & AON_BIT_SYSCFG_TRP_TEST_MODE_SEL) >> AON_SHIFT_SYSCFG_TRP_TEST_MODE_SEL);
	return test_mode_status;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE uint8_t get_pg_trap_status(const hal_gpio_func_stubs_t *pgpio_stubs)
{
	uint8_t test_pg_trap_gpio_status;
	hal_rtl_pinmux_register(PG_TRAP_PIN, PID_GPIO);
	_memset((void *)&test_mode_trap_gpio, 0, sizeof(hal_gpio_adapter_t));
	pgpio_stubs->hal_gpio_init(&test_mode_trap_gpio, PG_TRAP_PIN);
	pgpio_stubs->hal_gpio_set_dir(&test_mode_trap_gpio, GPIO_IN);
	test_pg_trap_gpio_status = pgpio_stubs->hal_gpio_read(&test_mode_trap_gpio);
	pgpio_stubs->hal_gpio_deinit(&test_mode_trap_gpio);
	hal_rtl_pinmux_unregister(PG_TRAP_PIN, PID_GPIO);
	return test_pg_trap_gpio_status;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE uint8_t get_cpft_sic_trap_status(const hal_gpio_func_stubs_t *pgpio_stubs)
{
	uint8_t test_cpft_sic_trap_gpio_status = 0x0;
	hal_rtl_pinmux_register(CPFT_TRAP_PIN, PID_GPIO);
	_memset((void *)&test_mode_trap_gpio, 0, sizeof(hal_gpio_adapter_t));

	pgpio_stubs->hal_gpio_init(&test_mode_trap_gpio, CPFT_TRAP_PIN);
	pgpio_stubs->hal_gpio_set_dir(&test_mode_trap_gpio, GPIO_IN);
	test_cpft_sic_trap_gpio_status = pgpio_stubs->hal_gpio_read(&test_mode_trap_gpio);
	pgpio_stubs->hal_gpio_deinit(&test_mode_trap_gpio);

