swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
	hal_rtl_pinmux_unregister(CPFT_TRAP_PIN, PID_GPIO);
	return test_cpft_sic_trap_gpio_status;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE uint8_t get_test_mode_trap_status(const hal_gpio_func_stubs_t *pgpio_stubs)
{
	uint8_t test_mode_trap_gpio_status = 0x0;
	hal_rtl_pinmux_register(PIN_A5, PID_GPIO);
	_memset((void *)&test_mode_trap_gpio, 0, sizeof(hal_gpio_adapter_t));

	pgpio_stubs->hal_gpio_init(&test_mode_trap_gpio, PIN_A5);
	pgpio_stubs->hal_gpio_set_dir(&test_mode_trap_gpio, GPIO_IN);
	test_mode_trap_gpio_status = pgpio_stubs->hal_gpio_read(&test_mode_trap_gpio);
	pgpio_stubs->hal_gpio_deinit(&test_mode_trap_gpio);

	hal_rtl_pinmux_unregister(PIN_A5, PID_GPIO);
	return test_mode_trap_gpio_status;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE uint8_t get_autoload_trap_status(const hal_gpio_func_stubs_t *pgpio_stubs)
{
	uint8_t test_mode_trap_gpio_status = 0x0;
	hal_rtl_pinmux_register(PIN_A4, PID_GPIO);
	_memset((void *)&test_mode_trap_gpio, 0, sizeof(hal_gpio_adapter_t));

	pgpio_stubs->hal_gpio_init(&test_mode_trap_gpio, PIN_A4);
	pgpio_stubs->hal_gpio_set_dir(&test_mode_trap_gpio, GPIO_IN);
	test_mode_trap_gpio_status = pgpio_stubs->hal_gpio_read(&test_mode_trap_gpio);
	pgpio_stubs->hal_gpio_deinit(&test_mode_trap_gpio);

	hal_rtl_pinmux_unregister(PIN_A4, PID_GPIO);
	return test_mode_trap_gpio_status;
}


SECTION_SYSSTART_TEXT
__STATIC_INLINE uint8_t get_test_mode_misc_option_trap_status(const hal_gpio_func_stubs_t *pgpio_stubs)
{
	const uint32_t tst_gpio_pins_qfn[(TST_GPIO_PIN_NUM + 1)] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
		PIN_D11, PIN_D13, PIN_E5, PIN_E6, 0xFF
#else
		PIN_E3, PIN_E4, PIN_F5, PIN_E0, 0xFF
#endif
	};
	uint32_t opt_pin_idx;
	const uint32_t *ptst_opt_pin;
	uint32_t tst_opt_pin_num;
	tst_opt_pin_num = TST_GPIO_PIN_NUM;
	ptst_opt_pin = tst_gpio_pins_qfn;
	uint8_t test_gpio_port_status;

	for (opt_pin_idx = 0; opt_pin_idx < tst_opt_pin_num; opt_pin_idx++) {
		if (ptst_opt_pin[opt_pin_idx] == 0xFF) {
			break;
		}
		hal_rtl_pinmux_register(ptst_opt_pin[opt_pin_idx], PID_GPIO);
		_memset((void *)&test_mode_trap_gpio, 0, sizeof(hal_gpio_adapter_t));
		pgpio_stubs->hal_gpio_init(&test_mode_trap_gpio, ptst_opt_pin[opt_pin_idx]);
		pgpio_stubs->hal_gpio_set_dir(&test_mode_trap_gpio, GPIO_IN);
		test_gpio_port_status = (test_gpio_port_status | (pgpio_stubs->hal_gpio_read(&test_mode_trap_gpio) << opt_pin_idx));
		pgpio_stubs->hal_gpio_deinit(&test_mode_trap_gpio);
		hal_rtl_pinmux_unregister(ptst_opt_pin[opt_pin_idx], PID_GPIO);
	}
	return test_gpio_port_status;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void test_mode_pinmux_init(void)
{
	AON_TypeDef *aon = AON;
	// Disable pinmux limit in testmode(0x400090B0[31:0]=0)
	aon->AON_REG_AON_TEST_MUX_CTRL = 0x0;
}

SECTION_SYSSTART_TEXT
__STATIC_INLINE void test_mode_sic_pinmux_init(void)
{
	AON_TypeDef *aon = AON;
	volatile uint32_t reg_val;

	// SIC Enable
	reg_val = aon->AON_REG_AON_FUNC_CTRL;
	reg_val |= AON_BIT_SYS_FEN_SIC;

	// SIC pinmux setting
	// it pins conflict with UART0
	uint8_t uart_idx = stdio_uart.uart_idx;
	if ((Uart0 == uart_idx) && (stdio_uart.is_inited)) {
		hal_rtl_gpio_pull_ctrl(dbg_uart_rx_pin, Pin_PullNone);
		hal_rtl_pinmux_unregister(stdio_uart.rx_pin, (PID_UART0 + uart_idx));
		hal_rtl_pinmux_unregister(stdio_uart.tx_pin, (PID_UART0 + uart_idx));
	}
	// 0x40009098[3:0]=1 ; 0x40009098[19:16]=1
	hal_rtl_pinmux_register(PIN_SIC_SCL, PID_SIC);
	hal_rtl_pinmux_register(PIN_SIC_SDA, PID_SIC);
	//dbg_printf("0x40009098=0x%x\r\n",HAL_READ32(0x40009098,0x0));
}


SECTION_SYSSTART_TEXT
__STATIC_INLINE void enable_tm_dbg_port(void)
{
	AON_TypeDef *aon = AON;
	SYSON_TypeDef *syson = SYSON;
	otp_boot_cfg_t *potp_boot_cfg = otpBootCfg;
	otp_boot_cfg4_t dbg_port_cfg;
	volatile uint32_t reg_val;
	uint8_t s_jtag_swd_sts = 0x0, ns_jtag_swd_sts = 0x0;
	hal_jtag_pin_t _jtag_pins;
	volatile uint8_t dbg_port_mod_sel;

	//hal_rtl_otp_init();
	//hal_rtl_otpc_ctrl(ENABLE, ENABLE, ENABLE); // Enable OTP controller, RW clocks
#if 0
	//NON-Fixed SKEY load
	HAL_WRITE32(0x50002C00, 0x30, 0x1C1D1E1F);
	HAL_WRITE32(0x50002C00, 0x34, 0x18191A1B);
	HAL_WRITE32(0x50002C00, 0x38, 0x14151617);
	HAL_WRITE32(0x50002C00, 0x3C, 0x10111213);

	HAL_WRITE32(0x50002C00, 0x40, 0x0C0D0E0F);
	HAL_WRITE32(0x50002C00, 0x44, 0x08090A0B);
	HAL_WRITE32(0x50002C00, 0x48, 0x04050607);
	HAL_WRITE32(0x50002C00, 0x4C, 0xDD010203);
	// Set SJTAG Secure unlock wait signal
	HAL_WRITE32(0x50002C00, 0x70, 0x1);
#endif

	//DBG_PORT status check
	reg_val = aon->AON_REG_AON_ATLOAD_CTRL1;
	s_jtag_swd_sts  = ((reg_val & AON_MASK_S_JTAG_SWD_MODE) >> AON_SHIFT_S_JTAG_SWD_MODE);
	ns_jtag_swd_sts = ((reg_val & AON_MASK_NS_JTAG_SWD_MODE) >> AON_SHIFT_NS_JTAG_SWD_MODE);

	if ((s_jtag_swd_sts != 0) ||
		(ns_jtag_swd_sts != 0)) {
		// either secure or non-secure JTAG/SWD is enabled

		dbg_port_mod_sel = potp_boot_cfg->byte.cfg4.bit.dbg_port_mod_sel;

		/*
		    JTAG/SWD Control Handles
		*/
		if (dbg_port_mod_sel == DbgPorSWD) {
			// SWD
			reg_val = 0x0;
			// DD confirm TM9 SWD/JTAG select is inside detect, do not need to set pin enable to DbgPorSWD
			reg_val |= (SYSON_BIT_RM5_DBG_PIN_EN | (DbgPorJTag << SYSON_SHIFT_RM5_DBG_MD_SEL) | (DISABLE << SYSON_SHIFT_DBG_CHAIN_EN));
			reg_val |= (DISABLE << SYSON_SHIFT_RM3_DBG_PIN_EN);
			reg_val |= (DbgPorSWD << SYSON_SHIFT_RM3_DBG_MD_SEL);
			syson->SYSON_REG_SYS_JTAG_SWD_CTRL = reg_val;
		} else {
			// JTAG
			reg_val = 0x0;
			reg_val |= (SYSON_BIT_RM5_DBG_PIN_EN | (DbgPorJTag << SYSON_SHIFT_RM5_DBG_MD_SEL) | (DISABLE << SYSON_SHIFT_DBG_CHAIN_EN));
			reg_val |= (DISABLE << SYSON_SHIFT_RM3_DBG_PIN_EN);
			reg_val |= (DbgPorSWD << SYSON_SHIFT_RM3_DBG_MD_SEL);
			syson->SYSON_REG_SYS_JTAG_SWD_CTRL = reg_val;
		}

		/*
		    JTAG/SWD PINMUX Handles
		*/
		dbg_port_cfg.byte = potp_boot_cfg->byte.cfg4.byte;
		if (dbg_port_mod_sel == DbgPorSWD) {
			// SWD
			_jtag_pins.pin_swdio = _dbg_port_tms_io_pin_sel[dbg_port_cfg.bit.dbg_port_tms_io_pin_sel];
			_jtag_pins.pin_swclk = _dbg_port_clk_pin_sel[dbg_port_cfg.bit.dbg_port_clk_pin_sel];
			hal_rtl_pinmux_register(_jtag_pins.pin_swclk, PID_JTAG);
			hal_rtl_pinmux_register(_jtag_pins.pin_swdio, PID_JTAG);
			hal_rtl_gpio_pull_ctrl(_jtag_pins.pin_swclk, Pin_PullUp);
			hal_rtl_gpio_pull_ctrl(_jtag_pins.pin_swdio, Pin_PullUp);
		} else {
			// JTAG
			uint32_t *pin;
			uint32_t i;
			_jtag_pins.pin_tms  = _dbg_port_tms_io_pin_sel[dbg_port_cfg.bit.dbg_port_tms_io_pin_sel];
			_jtag_pins.pin_tclk = _dbg_port_clk_pin_sel[dbg_port_cfg.bit.dbg_port_clk_pin_sel];
			_jtag_pins.pin_tdo  = _dbg_port_jtag_fixed_pins[0];
			_jtag_pins.pin_tdi  = _dbg_port_jtag_fixed_pins[1];
			_jtag_pins.pin_trst = _dbg_port_jtag_fixed_pins[2];
			pin = (uint32_t *)&_jtag_pins;
			for (i = 0; i < JTAG_PINS_SIZE; i++) {
				hal_rtl_pinmux_register(*(pin + i), PID_JTAG);
				hal_rtl_gpio_pull_ctrl(*(pin + i), Pin_PullUp);
			}
		}

