swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
	}
	//hal_rtl_otp_deinit();
}


SECTION_SYSSTART_TEXT
void _start_rtl8735b(void)
{
	uint8_t normal_pg_en;
	uint8_t spic_io_mode = SpicOneIOMode, boot_pin_sel = BootFlash_DualIOS0;
	otp_boot_cfg_t *potp_boot_cfg = otpBootCfg;
	otp_boot_cfg5_t *potp_boot_cfg5 = otpBootCfg5;
	otp_boot_cfg7_t *potp_boot_cfg7 = otpBootCfg7;
	uint8_t rma_state = RMA_NORMAL_STATE;
#if CONFIG_BOOT_TRAP_CTRL
#if (LOAD_FLAH_IMG_EN || !(CONFIG_FPGA))
	uint32_t test_mode;
	uint32_t boot_mode = BootFromNORFlash;
	uint8_t test_pg_trap_gpio;
	uint8_t test_gpio_port;

#endif  // end of "#if (LOAD_FLAH_IMG_EN || !(CONFIG_FPGA))"
#endif

#if CONFIG_FPGA || CONFIG_PXP
	pwr_seq(); // Workaround for Power sequence not ready
#endif
#if defined(CONFIG_BUILD_SECURE)
	symb_ns4s_t *symb_ns4s_stubs = (symb_ns4s_t *)(NS_SYMBOL_STUBS_ADDR);
#endif
	const hal_gpio_func_stubs_t *pgpio_stubs = &hal_gpio_stubs;
	ROM_FOOTPH_INIT(BOOT_INFO_IDX0);
	ROM_FOOTPH_INIT(BOOT_INFO_IDX1);
	ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 0);

	// ROM version number
	rom_info_store();

	// Clean BSS before enable D-Cache
	// Clear ROM use BSS and initial ROM DATA
	rom_bss_data_init();
#if defined(CONFIG_BUILD_SECURE) && (LOAD_FLAH_IMG_EN || !(CONFIG_FPGA))
	rom_sboot_bss_clean_up();
	rom_sboot_export_bss_clean_up();
#endif
	hal_rtl_irq_api_init(NULL);
#if defined(CONFIG_BUILD_SECURE)
	// Initial data,BSS for NS ROM
	if (NULL != symb_ns4s_stubs->startup_ns) {
		((void(*)(void))(symb_ns4s_stubs->startup_ns))();
	}
#endif


	SystemInit();

	// Enable vendor control
	vendor_init();
	// Set PON SRAM to Normal Mode
	pon_sram_init();

#if CONFIG_ROM_ICACHE_EN
	// Enable I-Cache
	rtl_icache_enable();
#endif
	// re-direct vector table to RAM
	hal_rtl_vector_table_init((uint32_t)&__StackTop, ram_vector_table);

#if CONFIG_ROM_DCACHE_EN
	// Enable D-Cache
	if (DISABLE == (potp_boot_cfg7->bit.rom_dcache_dis)) {
		rtl_dcache_enable();
	}
#endif

	ConfigDebugErr = 0;
	ConfigDebugWarn = 0;
	ConfigDebugInfo = 0;

	timer_init_rom();                       // maintain by John
	pinmux_init_rom();

#if CONFIG_FPGA
#if CONFIG_BOOT_OTP_SIMU_AUTO_EN
	uint8_t autoload_not_set = DISABLE;
	// OTP simulation setting value only for FPGA
	otp_load_simulation_rom(&autoload_not_set);
#endif
	autold_fail_self_cfg();
	//Non-Fixed Key Mode Tests here - Select **ONLY ONE** out of 3 tests below for testing by uncommenting the desired function

	//non_fixed_secure_jtag_test();
	//non_fixed_non_secure_jtag_test();
	//non_fixed_secure_cum_non_secure_jtag_test();
#endif

	ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 1);

#if CONFIG_PXP  // PXP
	// Init debug printf
	ConfigDebugErr = 0xFFFFFFFF;
	stdio_uart_port_init();
#else   // FPGA & ASIC

	// Confirm rom dbg msg enable or not
	if (BootDbgMsgOn == (potp_boot_cfg->byte.cfg2.bit.boot_rom_dbg_msg_dis)) {
		// Init debug printf
		ConfigDebugErr = 0xFFFFFFFF;
		stdio_uart_port_init();
	}
#if CONFIG_BOOT_OTP_SIMU_AUTO_EN
	if (ENABLE == autoload_not_set) {
		// Enable VNDR WDT, for autoload AON/ keys to engine
		wdt_init_rom();
		dbg_printf("FPGA autoload fail! Wait for WDT Reset...\r\n");
		while (1);
	}
#endif

#endif

#if CONFIG_PXP & (LOAD_FLAH_IMG_EN == 0)
	pRamStartFun = (PRAM_FUNCTION_START_TABLE) __ram_start_table_start__;
	show_welcome_message();
#else
	// FPGA, asic, (pxp with LOAD_FLAH_IMG_EN ==1)

#if CONFIG_BOOT_TRAP_CTRL
	// CONFIG_BOOT_TRAP_CTRL enable

	// Check operate RMA flow
	rma_state = chk_op_rma_flow();

	test_mode = get_test_mode_status();

	if (test_mode) {
		ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 2);
		//dbg_printf("trap pin Test mode\r\n");

		// Disable AON WDT, before enter to the test_mode
		hal_rtl_wdt_ctrl_aon_disable();

		test_mode_pinmux_init();     // Disable pinmux testmode, before enter to the test_mode. Default test mode cannot use pinmux

		test_mode_sic_pinmux_init(); // Confirm enter test mode, sic pinmux init

		// Test mode
		// GPIO Group init

		pgpio_stubs->hal_gpio_comm_init(&gpio_comm);

		test_pg_trap_gpio = get_pg_trap_status(pgpio_stubs);
		if (!test_pg_trap_gpio) {
			// Not in Flash PG mode
			// Check CP_FT SW trap pin for SIC
			uint8_t test_cpft_trap_gpio;
			test_cpft_trap_gpio = get_cpft_sic_trap_status(pgpio_stubs);

			// check CP/FT trap pin to park CPU: if E7 == 1, then park CPU here.
			if (test_cpft_trap_gpio == 1) {
				// Make CPU park here to prevent interfer SIC operation
				// Disable CPU via SIC interface to operate
				dbg_printf("CPU park here\r\n");
				while (1);
			}

			// In test mode, read GPIO pins (D11, D13, E5, E6) as the option of test mode
			test_gpio_port = 0;
			test_gpio_port = get_test_mode_misc_option_trap_status(pgpio_stubs);
			//dbg_printf("trap pin option of test mode\r\n");
		} else {
			//dbg_printf("trap pin PG\r\n");
		}
		// GPIO Group deinit
		pgpio_stubs->hal_gpio_comm_deinit();

	} else {
		ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 3);
		//dbg_printf("trap pin Normal mode\r\n");
		// 1. Enable Vendor wdt, AON wdt default hw already enable
		wdt_init_rom();

		// 2. confirm boot_mode from OTP autoload
		boot_mode = potp_boot_cfg->byte.cfg1.bit.boot_comm.boot_sel;

		/*
		  3. check boot mode pin conflict or not
		*/
	}
#else
	// CONFIG_BOOT_TRAP_CTRL Disable

#if CONFIG_BOOT_SETMOD_EN
	hal_rtl_wdt_ctrl_aon_disable();
	boot_setmode_shell();
#else
	test_mode = 0;
	test_pg_trap_gpio = 0;
#endif  // end of CONFIG_BOOT_SETMOD_EN

	wdt_init_rom();
#endif  // end of CONFIG_BOOT_TRAP_CTRL

	show_welcome_message();
	if (!test_mode) {
		dbg_printf("\r\n[Normal mode]\r\n");
		if (potp_boot_cfg5->bit.boot_normal_sic_en == ENABLE) {
			test_mode_sic_pinmux_init(); // Confirm Normal mode can use SIC, sic pinmux init
		}
		if ((BootDbgMsgOn == (potp_boot_cfg->byte.cfg2.bit.boot_rom_dbg_msg_dis)) &&
			(ENABLE == stdio_uart.is_inited)) {
			normal_pg_en = chk_normal_mode_pg();
		}
		if (ENABLE == normal_pg_en) {
			// Disable AON & VNDRT WDT, before enter to the PG mode
			hal_rtl_wdt_ctrl_all_disable();

			uboot_frame_handle.ram_start_tbl = 0;
			test_mode_img_download();

			// Enable VNDR WDT, after exit to the PG mode
			hal_rtl_wdt_enable();

			// Check if the image is downloaded to RAM directly
			chk_img_to_ram_direct(&boot_mode);
		} else {
#if !CONFIG_BOOT_TRAP_CTRL
			boot_mode = BootFromJTAG_FPGALOAD;
#else
			boot_mode = potp_boot_cfg->byte.cfg1.bit.boot_comm.boot_sel;
			//boot_mode = BootFromNORFlash;
#endif
			ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 4);
		}
	} else {
		// Test mode
		// Confirm otp autoload boot config, because some test mode will triger operate device boot flow
		dbg_printf("Test Mode: boot_cfg1=0x%x\r\n", potp_boot_cfg->byte.cfg1.byte);
		boot_mode    = potp_boot_cfg->byte.cfg1.bit.boot_comm.boot_sel;
		boot_pin_sel = potp_boot_cfg->byte.cfg1.bit.boot_comm.boot_pin_sel;

		if (test_pg_trap_gpio) {

			dbg_printf("\r\n[test mode PG]\r\n");

			uboot_frame_handle.ram_start_tbl = 0;
			test_mode_img_download();

			// Check if the image is downloaded to RAM directly
			chk_img_to_ram_direct(&boot_mode);
		} else {
			dbg_printf("\r\n[MISC option mode]\r\n");
#if IS_CUT_TEST(CONFIG_CHIP_VER)
			dbg_printf("Test Mode GPIO[E6, E5, D13, D11] = 0x%x\r\n", test_gpio_port);
#else
			dbg_printf("Test Mode GPIO[E0, F5, E4, E3] = 0x%x\r\n", test_gpio_port);
#endif
			switch (test_gpio_port) {
			case TEST_MODE_MISC_OPT0:
				dbg_printf("TEST_MODE_MISC_OPT0\r\n");
				break;

			case TEST_MODE_MISC_OPT1:
				dbg_printf("TEST_MODE_MISC_OPT1\r\n");
				break;

			case TEST_MODE_MISC_OPT2:
				dbg_printf("TEST_MODE_MISC_OPT2\r\n");
				break;

