swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
			case TEST_MODE_MISC_OPT3:
				dbg_printf("TEST_MODE_MISC_OPT3\r\n");
				break;

			case TEST_MODE_MISC_OPT4:
				dbg_printf("TEST_MODE_MISC_OPT4\r\n");
				break;

			case TEST_MODE_MISC_OPT5:
				dbg_printf("TEST_MODE_MISC_OPT5\r\n");
				break;

			case TEST_MODE_MISC_OPT6:
				dbg_printf("TEST_MODE_MISC_OPT6\r\n");
				break;

			case TEST_MODE_MISC_OPT7:
				dbg_printf("TEST_MODE_MISC_OPT7\r\n");
				break;

			case TEST_MODE_MISC_OPT8:
				dbg_printf("TEST_MODE_MISC_OPT8\r\n");
				break;

			case TEST_MODE_MISC_OPT9:
				dbg_printf("TEST_MODE_MISC_OPT9\r\n");
				break;

			case TEST_MODE_MISC_OPT10:
				dbg_printf("TEST_MODE_MISC_OPT10\r\n");
				break;

			case TEST_MODE_MISC_OPT11:
				dbg_printf("TEST_MODE_MISC_OPT11\r\n");
				break;

			case TEST_MODE_MISC_OPT12:
				dbg_printf("TEST_MODE_MISC_OPT12\r\n");
				break;

			case TEST_MODE_MISC_OPT13:
				dbg_printf("TEST_MODE_MISC_OPT13\r\n");
				// Enable pin-mux for TM JTAG/SWD
				enable_tm_dbg_port();
#if 0
				// Dbg TM JTAG/SWD control and pinmux
				dbg_printf("0x400090BC:0x%x\r\n", HAL_READ32(0x400090BC, 0x0));
				dbg_printf("0x40009094:0x%x\r\n", HAL_READ32(0x40009094, 0x0));
				dbg_printf("0x40000070:0x%x\r\n", HAL_READ32(0x40000070, 0x0));
				dbg_printf("0x4000985C:0x%x\r\n", HAL_READ32(0x4000985C, 0x0));
				dbg_printf("0x40009864:0x%x\r\n", HAL_READ32(0x40009864, 0x0));
				dbg_printf("0x40009868:0x%x\r\n", HAL_READ32(0x40009868, 0x0));
#endif
				// CPU Park here leave JTAG contorl
				while (1);
				break;

			case TEST_MODE_MISC_OPT14:
				dbg_printf("TEST_MODE_MISC_OPT14\r\n");
				boot_command_shell();
				break;

			case TEST_MODE_MISC_OPT15:
				dbg_printf("TEST_MODE_MISC_OPT15\r\n");
				// Note: Check device life cycle state to allow or not
				uboot_frame_handle.ram_start_tbl = 0;
				test_mode_img_download();
				// Check if the image is downloaded to RAM directly
				chk_img_to_ram_direct(&boot_mode);
				break;

			default:
				boot_command_shell();
				break;
			}
			potp_boot_cfg->byte.cfg1.bit.boot_comm.boot_sel = boot_mode;
			potp_boot_cfg->byte.cfg1.bit.boot_comm.boot_pin_sel = boot_pin_sel;
		}
	}

#if CONFIG_FPGA // FPGA only
#if CONFIG_BOOT_DBG_PORT_AUTO_SEL_EN    // if not enable, not chagned default swd/jtag sw control setting(using FPGA JTAG dedicated pins)
	// Enable pin-mux for TM JTAG/SWD using OTP autoload
	enable_tm_dbg_port();
#endif
#else // PXP, ASIC
	// Enable pin-mux for TM JTAG/SWD using OTP autoload
	enable_tm_dbg_port();
#endif

	if (BootFromNORFlash == boot_mode) {
		spic_io_mode = potp_boot_cfg->byte.cfg1.bit.norflash_boot.io_mode_sel;
		boot_pin_sel = potp_boot_cfg->byte.cfg1.bit.norflash_boot.pin_sel;
	}

	if (!fast_reboot_rdy) {
		if (test_mode) {
			// Test mode, after PG or other test mdoe misc options
			// Init VNDR WDT, after exit to the PG or other test mdoe misc options
			wdt_init_rom();

		} else {
			// Normal mode
			// Refresh VNDR WDT
			hal_rtl_wdt_refresh();
		}
		ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 5);
		if (boot_mode == BootFromNORFlash) {
			hal_status_t ret;
			uint8_t spic_set_io_mode = spic_io_mode;

			dbg_printf("BootFromNORFlash\r\n");
			// Due to Pro2 rom code always using SpicOneIOMode
			spic_set_io_mode = SpicOneIOMode;
			// Due to Pro2 current only has 1 pin select
			boot_pin_sel = BootFlash_DualIOS0;

			ret = fw_spic_init(&_hal_spic_adaptor, spic_set_io_mode, boot_pin_sel);
			if (ret == HAL_OK) {
				ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 7);
				ret = flash_boot(&pRamStartFun);
				if (ret != SUCCESS) {
					pRamStartFun = (PRAM_FUNCTION_START_TABLE)NULL;
				} else {
					if (test_mode) {
						// Enable sys_fen_sic
					}
				}
				flash_rtl_return_spi(&_hal_spic_adaptor);
				fw_spic_deinit(&_hal_spic_adaptor);
				ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 20);
				// Refresh VNDR WDT
				hal_rtl_wdt_refresh();
			} else {
				pRamStartFun = (PRAM_FUNCTION_START_TABLE)NULL;
				DBG_BOOT_ERR("Flash init error (io_mod=%u, pin_sel=%u)\r\n", spic_set_io_mode, boot_pin_sel);
				fw_spic_deinit(&_hal_spic_adaptor);

				// Fallback to SNAND flash
				dbg_printf("Fallback SNAND Flash\r\n");
				boot_mode = BootFromNANDFlash;
				goto NAND_FLASH_BOOT;
			}
		} else if (boot_mode == BootFromNANDFlash) {
			hal_status_t ret;

NAND_FLASH_BOOT:

			dbg_printf("BootFromNANDFlash\r\n");
			// TODO fpga may error
			*(hal_snand_boot_stubs.rom_snand_boot) = 1;

			// FIXME IO mode and Pin is not used by fw_snafc_init
			ret = fw_snafc_init(&_hal_snafc_adaptor, SpicOneIOMode, BootFlash_DualIOS0);

			if (ret == HAL_OK) {
				dbg_printf("snafc init pass\r\n");
				ret = snand_flash_boot(&pRamStartFun);
				if (ret != HAL_OK) {
					pRamStartFun = (PRAM_FUNCTION_START_TABLE) NULL;
				}
				fw_snafc_deinit(&_hal_snafc_adaptor);
				dbg_printf("snafc deinit pass\r\n");
			} else {
				pRamStartFun = (PRAM_FUNCTION_START_TABLE) NULL;
				dbg_printf("snafc init error\r\n");
				fw_snafc_deinit(&_hal_snafc_adaptor);
			}

			// Refresh VNDR WDT
			hal_rtl_wdt_refresh();
#if 0
			dbg_printf("fw_snafc_init freeze at %s:%d\r\n", __FILE__, __LINE__);
			while (1);
#endif

		} else if (boot_mode == BootFromUART) {
			dbg_printf("BootFromUART\r\n");
			// Refresh VNDR WDT
			//hal_rtl_wdt_refresh();
			// Disable AON & VNDRT WDT, before enter to the PG mode
			hal_rtl_wdt_ctrl_all_disable();
			uart_boot(&pRamStartFun);
		} else if (boot_mode == BootFromTestModeUART) {
			dbg_printf("BootFromTestModeUART\r\n");
			// Refresh VNDR WDT
			hal_rtl_wdt_refresh();
		} else if (boot_mode == BootFromJTAG_FPGALOAD) {    // Only for FPGA development load
#if CONFIG_FPGA // FPGA only
			dbg_printf("BootFromJTAG_FPGALOAD\r\n");
			pRamStartFun = (PRAM_FUNCTION_START_TABLE) __ram_start_table_start__;
#endif
		} else {
			DBG_BOOT_ERR("Unknow boot mode(0x%x); otp boot cfg = 0x%x\r\n", boot_mode, potp_boot_cfg->byte.cfg1.byte);
		}
	} else {
		dbg_printf("Fast Reboot to 0x%x\r\n", pRamStartFun->RamStartFun);
	}
#endif // end of CONFIG_PXP & (LOAD_FLAH_IMG_EN == 0)

	// check the RAM image signature
	if (pRamStartFun != NULL && (!chk_ram_img_signature(pRamStartFun->Signature))) {
		RAM_START_FUNCTION ram_start_func;
		if (stdio_uart.is_inited) {
			uint8_t uart_idx;

			ConfigDebugErr = 0;
			uart_idx = stdio_uart.uart_idx;
			hal_rtl_uart_deinit(&stdio_uart);
			_stdio_port_deinit();

