swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/cmsis/rtl8735b/lib/source/rom_s/startup.c
			// Todo release UART RX Pin pull control
			hal_rtl_gpio_pull_ctrl(dbg_uart_rx_pin, Pin_PullNone);
			hal_rtl_pinmux_unregister(stdio_uart.rx_pin, (PID_UART0 + uart_idx));
			hal_rtl_pinmux_unregister(stdio_uart.tx_pin, (PID_UART0 + uart_idx));
		}

		// pinmux info backup
		hal_rtl_pinmux_rom_info_manage(&_pinmux_manager, OP_BACKUP, ALL_LOG);

		// Todo vendor wdt disable or refresh
		// Refresh VNDR WDT
		hal_rtl_wdt_refresh();

		// Todo D-cache disable
		rtl_dcache_disable();

		pRamStartFun->boot_cfg_w = potp_boot_cfg->word;

		ram_start_func.RamStartFun = pRamStartFun->RamStartFun;
		ROM_FOOTPH_STORE(BOOT_INFO_IDX0, 21);
		if (ram_start_addr_valid((uint32_t)ram_start_func.RamStartFun)) {
			if ((pRamStartFun->msp_start != 0) && (pRamStartFun->msp_start > pRamStartFun->msp_limit)) {
				// switch the main stack memory as the application defined
				__disable_irq();
				__ISB();
				__set_MSP((uint32_t)pRamStartFun->msp_start);
				__set_MSPLIM((uint32_t)pRamStartFun->msp_limit);
				// !!! Don't access local variable after this line... !!!
				__enable_irq();
				__DSB();
				__ISB();
			}
			ram_start_func.RamStartFun();
		} else {
			goto _start_invalid_start_tbl;
		}
	} else {
_start_invalid_start_tbl:
		if (ConfigDebugErr == 0) {
			stdio_uart_port_init();
			ConfigDebugErr = 0xFFFFFFFF;
		}
#if defined(CONFIG_BUILD_SECURE) && (LOAD_FLAH_IMG_EN || !(CONFIG_FPGA))
		rom_sboot_bss_clean_up();
		rom_sboot_export_bss_clean_up();
#endif
		dbg_printf("StartUp@0x%x: Invalid RAM Img Signature!\r\n", pRamStartFun);
		boot_command_shell();
		while (1);
	}
}

